TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.6 *
       3                    ;* Date/Time created: Wed Feb 10 23:08:32 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disabl
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../parse.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.6 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti6\workspace\tiva-pid\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("UARTCharPut")
      15                            .dwattr $C$DW$1, DW_AT_TI_symbol_name("UARTCharPut")

    2620                    ;----------------------------------------------------------------------
    2621 000006d6 9901              LDR       A2, [SP, #4]          ; [DPU_3_PIPE] |448|  ; [ORIG 16-BIT INS]
    2622 000006d8 0008F89D          LDRB      A1, [SP, #8]          ; [DPU_3_PIPE] |448|  ; [KEEP 32-BIT INS]
    2623 000006dc 7448              STRB      A1, [A2, #17]         ; [DPU_3_PIPE] |448|  ; [ORIG 16-BIT INS]
    2624                            .dwpsn  file "../parse.c",line 449,column 2,is_stmt,isa 1
    2625                    ;----------------------------------------------------------------------
    2626                    ; 449 | sendReply(synPtr, 4);                                                  
    2627                    ;----------------------------------------------------------------------
    2628 000006de 9801              LDR       A1, [SP, #4]          ; [DPU_3_PIPE] |449|  ; [ORIG 16-BIT INS]
    2629 000006e0 2104              MOVS      A2, #4                ; [DPU_3_PIPE] |449|  ; [ORIG 16-BIT INS]
    2630                    $C$DW$73        .dwtag  DW_TAG_TI_branch
    2631                            .dwattr $C$DW$73, DW_AT_low_pc(0x00)
    2632                            .dwattr $C$DW$73, DW_AT_name("sendReply")
    2633                            .dwattr $C$DW$73, DW_AT_TI_call
    2634 000006e2 FE80F7FF          BL        sendReply             ; [DPU_3_PIPE] |449|  ; [KEEP 32-BIT INS]
    2635                            ; CALL OCCURS {sendReply }       ; [] |449| 
    2636                            .dwpsn  file "../parse.c",line 450,column 1,is_stmt,isa 1
    2637 000006e6 B005              ADD       SP, SP, #20           ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
    2638                            .dwcfi  cfa_offset, 4
    2639                    $C$DW$74        .dwtag  DW_TAG_TI_branch
    2640                            .dwattr $C$DW$74, DW_AT_low_pc(0x00)
    2641                            .dwattr $C$DW$74, DW_AT_TI_return
    2642 000006e8 BD00              POP       {PC}                  ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
    2643                            .dwcfi  cfa_offset, 0
    2644                            ; BRANCH OCCURS                  ; [] 
    2645                            .dwattr $C$DW$66, DW_AT_TI_end_file("../parse.c")
    2646                            .dwattr $C$DW$66, DW_AT_TI_end_line(0x1c2)
    2647                            .dwattr $C$DW$66, DW_AT_TI_end_column(0x01)
    2648                            .dwendentry
    2649                            .dwendtag $C$DW$66
    2650                    
    2651                    ;******************************************************************************
    2652                    ;* CONSTANT TABLE                                                             *
    2653                    ;******************************************************************************
    2654 000006ea                   .sect   ".text"
    2655                            .align  4
    2656 000006ea D00046C0  ||$C$CON4||:    .bits   1073795072,32
         000006ee 00004000 
    2657                    ;*****************************************************************************
    2658                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2659                    ;*****************************************************************************
    2660                            .global UARTCharPut
    2661                            .global PRINTF
    2662                            .global uart1buffer
    2663                            .global RX_PTR1
    2664                            .global READ_PTR1
    2665                    
    2666                    ;******************************************************************************
    2667                    ;* BUILD ATTRIBUTES                                                           *
    2668                    ;******************************************************************************
    2669                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   50

    2670                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    2671                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    2672                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    2673                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    2674                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
    2675                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
    2676                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    2677                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    2678                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    2679                    
    2680                    ;******************************************************************************
    2681                    ;* TYPE INFORMATION                                                           *
    2682                    ;******************************************************************************
    2683                    
    2684                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2685                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    2686                    $C$DW$75        .dwtag  DW_TAG_member
    2687                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$10)
    2688                            .dwattr $C$DW$75, DW_AT_name("quot")
    2689                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("quot")
    2690                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2691                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    2692                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2693                            .dwattr $C$DW$75, DW_AT_decl_line(0x50)
    2694                            .dwattr $C$DW$75, DW_AT_decl_column(0x16)
    2695                    $C$DW$76        .dwtag  DW_TAG_member
    2696                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$10)
    2697                            .dwattr $C$DW$76, DW_AT_name("rem")
    2698                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("rem")
    2699                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2700                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2702                            .dwattr $C$DW$76, DW_AT_decl_line(0x50)
    2703                            .dwattr $C$DW$76, DW_AT_decl_column(0x1c)
    2704                            .dwendtag $C$DW$T$19
    2705                    
    2706                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2707                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x50)
    2708                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    2709                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    2710                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$19)
    2711                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2712                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2713                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
    2714                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x23)
    2715                    
    2716                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2717                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    2718                    $C$DW$77        .dwtag  DW_TAG_member
    2719                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$10)
    2720                            .dwattr $C$DW$77, DW_AT_name("quot")
    2721                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("quot")
    2722                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2723                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    2724                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   51

    2725                            .dwattr $C$DW$77, DW_AT_decl_line(0x52)
    2726                            .dwattr $C$DW$77, DW_AT_decl_column(0x16)
    2727                    $C$DW$78        .dwtag  DW_TAG_member
    2728                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$10)
    2729                            .dwattr $C$DW$78, DW_AT_name("rem")
    2730                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("rem")
    2731                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2732                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    2733                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2734                            .dwattr $C$DW$78, DW_AT_decl_line(0x52)
    2735                            .dwattr $C$DW$78, DW_AT_decl_column(0x1c)
    2736                            .dwendtag $C$DW$T$20
    2737                    
    2738                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2739                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x52)
    2740                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    2741                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2742                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$20)
    2743                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2744                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2745                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x52)
    2746                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x23)
    2747                    
    2748                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2749                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2750                    $C$DW$79        .dwtag  DW_TAG_member
    2751                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$14)
    2752                            .dwattr $C$DW$79, DW_AT_name("quot")
    2753                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("quot")
    2754                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2755                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    2756                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2757                            .dwattr $C$DW$79, DW_AT_decl_line(0x55)
    2758                            .dwattr $C$DW$79, DW_AT_decl_column(0x1c)
    2759                    $C$DW$80        .dwtag  DW_TAG_member
    2760                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$14)
    2761                            .dwattr $C$DW$80, DW_AT_name("rem")
    2762                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("rem")
    2763                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2764                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2765                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2766                            .dwattr $C$DW$80, DW_AT_decl_line(0x55)
    2767                            .dwattr $C$DW$80, DW_AT_decl_column(0x22)
    2768                            .dwendtag $C$DW$T$21
    2769                    
    2770                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2771                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
    2772                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2773                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2774                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$21)
    2775                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2776                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2777                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x55)
    2778                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x29)
    2779                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   52

    2780                    $C$DW$T$23      .dwtag  DW_TAG_union_type
    2781                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    2782                    $C$DW$81        .dwtag  DW_TAG_member
    2783                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    2784                            .dwattr $C$DW$81, DW_AT_name("_Word")
    2785                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Word")
    2786                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2787                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2788                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    2789                            .dwattr $C$DW$81, DW_AT_decl_line(0x81)
    2790                            .dwattr $C$DW$81, DW_AT_decl_column(0x11)
    2791                    $C$DW$82        .dwtag  DW_TAG_member
    2792                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$16)
    2793                            .dwattr $C$DW$82, DW_AT_name("_Float")
    2794                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Float")
    2795                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2797                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    2798                            .dwattr $C$DW$82, DW_AT_decl_line(0x82)
    2799                            .dwattr $C$DW$82, DW_AT_decl_column(0x08)
    2800                    $C$DW$83        .dwtag  DW_TAG_member
    2801                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$17)
    2802                            .dwattr $C$DW$83, DW_AT_name("_Double")
    2803                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Double")
    2804                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2805                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2806                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    2807                            .dwattr $C$DW$83, DW_AT_decl_line(0x83)
    2808                            .dwattr $C$DW$83, DW_AT_decl_column(0x09)
    2809                    $C$DW$84        .dwtag  DW_TAG_member
    2810                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$18)
    2811                            .dwattr $C$DW$84, DW_AT_name("_Long_double")
    2812                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Long_double")
    2813                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2814                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2815                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    2816                            .dwattr $C$DW$84, DW_AT_decl_line(0x84)
    2817                            .dwattr $C$DW$84, DW_AT_decl_column(0x0e)
    2818                            .dwendtag $C$DW$T$23
    2819                    
    2820                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    2821                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x80)
    2822                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x02)
    2823                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    2824                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$23)
    2825                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2826                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    2827                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x85)
    2828                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x04)
    2829                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2830                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2831                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2832                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2833                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2834                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   53

    2835                    $C$DW$T$90      .dwtag  DW_TAG_subroutine_type
    2836                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2837                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    2838                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    2839                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    2840                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("__TI_atexit_fn")
    2841                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2842                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    2843                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2844                            .dwattr $C$DW$T$92, DW_AT_decl_line(0xa3)
    2845                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x14)
    2846                    $C$DW$T$93      .dwtag  DW_TAG_const_type
    2847                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$2)
    2848                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2849                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2850                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    2851                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2852                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2853                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2854                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2855                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2856                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2857                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2858                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2859                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    2860                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$5)
    2861                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2862                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2863                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x2a)
    2864                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x1d)
    2865                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    2866                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    2867                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2868                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2869                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x37)
    2870                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x17)
    2871                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2872                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2873                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2874                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2875                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    2876                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$6)
    2877                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2878                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2879                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x2b)
    2880                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x1c)
    2881                    
    2882                    $C$DW$T$61      .dwtag  DW_TAG_array_type
    2883                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$56)
    2884                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2885                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    2886                    $C$DW$85        .dwtag  DW_TAG_subrange_type
    2887                            .dwattr $C$DW$85, DW_AT_upper_bound(0x03)
    2888                            .dwendtag $C$DW$T$61
    2889                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   54

    2890                    
    2891                    $C$DW$T$63      .dwtag  DW_TAG_array_type
    2892                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$56)
    2893                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2894                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    2895                    $C$DW$86        .dwtag  DW_TAG_subrange_type
    2896                            .dwattr $C$DW$86, DW_AT_upper_bound(0x07)
    2897                            .dwendtag $C$DW$T$63
    2898                    
    2899                    $C$DW$T$98      .dwtag  DW_TAG_volatile_type
    2900                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$56)
    2901                    
    2902                    $C$DW$T$99      .dwtag  DW_TAG_array_type
    2903                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    2904                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    2905                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x10)
    2906                    $C$DW$87        .dwtag  DW_TAG_subrange_type
    2907                            .dwattr $C$DW$87, DW_AT_upper_bound(0x0f)
    2908                            .dwendtag $C$DW$T$99
    2909                    
    2910                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    2911                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$56)
    2912                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    2913                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2914                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x38)
    2915                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x16)
    2916                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2917                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2918                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2919                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2920                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2921                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2922                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2923                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2924                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    2925                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
    2926                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    2927                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2928                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2c)
    2929                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x1d)
    2930                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    2931                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$54)
    2932                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    2933                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2934                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x3a)
    2935                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x17)
    2936                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2937                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2938                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2939                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2940                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    2941                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$9)
    2942                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    2943                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    2944                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x1fe)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   55

    2945                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x21)
    2946                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    2947                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$9)
    2948                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    2949                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    2950                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x1ff)
    2951                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x21)
    2952                    
    2953                    $C$DW$T$22      .dwtag  DW_TAG_array_type
    2954                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    2955                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2956                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    2957                    $C$DW$88        .dwtag  DW_TAG_subrange_type
    2958                            .dwattr $C$DW$88, DW_AT_upper_bound(0x07)
    2959                            .dwendtag $C$DW$T$22
    2960                    
    2961                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    2962                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$9)
    2963                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2964                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2965                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2d)
    2966                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x1c)
    2967                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    2968                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$62)
    2969                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    2970                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    2971                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x3b)
    2972                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x16)
    2973                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    2974                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$9)
    2975                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    2976                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    2977                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x6a)
    2978                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x1a)
    2979                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2980                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2981                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2982                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2983                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    2984                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$10)
    2985                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    2986                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    2987                            .dwattr $C$DW$T$107, DW_AT_decl_line(0xa6)
    2988                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x1e)
    2989                    
    2990                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    2991                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$10)
    2992                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2993                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
    2994                    $C$DW$89        .dwtag  DW_TAG_subrange_type
    2995                            .dwattr $C$DW$89, DW_AT_upper_bound(0x04)
    2996                            .dwendtag $C$DW$T$49
    2997                    
    2998                    
    2999                    $C$DW$T$109     .dwtag  DW_TAG_subroutine_type
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   56

    3000                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$10)
    3001                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3002                    $C$DW$90        .dwtag  DW_TAG_formal_parameter
    3003                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$94)
    3004                    $C$DW$91        .dwtag  DW_TAG_formal_parameter
    3005                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$94)
    3006                            .dwendtag $C$DW$T$109
    3007                    
    3008                    $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    3009                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    3010                            .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    3011                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("__TI_compar_fn")
    3012                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    3013                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3014                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    3015                            .dwattr $C$DW$T$111, DW_AT_decl_line(0xa6)
    3016                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x13)
    3017                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3018                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$10)
    3019                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    3020                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3021                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x2e)
    3022                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x1d)
    3023                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3024                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    3025                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3026                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3027                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x47)
    3028                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x17)
    3029                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3030                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$112)
    3031                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3032                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3033                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x4a)
    3034                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x17)
    3035                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3036                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$112)
    3037                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3038                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3039                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x45)
    3040                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x17)
    3041                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3042                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$112)
    3043                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    3044                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3045                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x3c)
    3046                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x17)
    3047                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3048                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$10)
    3049                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    3050                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3051                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x52)
    3052                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x1a)
    3053                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3054                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   57

    3055                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3056                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3057                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    3058                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$11)
    3059                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3060                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3061                            .dwattr $C$DW$T$118, DW_AT_decl_line(0xac)
    3062                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x1a)
    3063                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3064                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$11)
    3065                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    3066                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    3067                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x64)
    3068                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x19)
    3069                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    3070                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$11)
    3071                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3072                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3073                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2f)
    3074                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    3075                    
    3076                    $C$DW$T$51      .dwtag  DW_TAG_array_type
    3077                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3078                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3079                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x20)
    3080                    $C$DW$92        .dwtag  DW_TAG_subrange_type
    3081                            .dwattr $C$DW$92, DW_AT_upper_bound(0x07)
    3082                            .dwendtag $C$DW$T$51
    3083                    
    3084                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    3085                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$50)
    3086                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3087                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3088                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x48)
    3089                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x16)
    3090                    $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    3091                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$50)
    3092                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    3093                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3094                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x4b)
    3095                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x16)
    3096                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    3097                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$50)
    3098                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3099                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3100                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x46)
    3101                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x16)
    3102                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    3103                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$50)
    3104                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    3105                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3106                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x3d)
    3107                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x16)
    3108                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    3109                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$11)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   58

    3110                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    3111                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3112                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x53)
    3113                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x1a)
    3114                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3115                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3116                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3117                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3118                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    3119                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$12)
    3120                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3121                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3122                            .dwattr $C$DW$T$125, DW_AT_decl_line(0xa2)
    3123                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x0e)
    3124                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3125                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3126                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3127                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3128                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    3129                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$13)
    3130                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    3131                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3132                            .dwattr $C$DW$T$126, DW_AT_decl_line(0xa3)
    3133                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x17)
    3134                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3135                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3136                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3137                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3138                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    3139                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$14)
    3140                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    3141                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3142                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x1ce)
    3143                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x13)
    3144                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    3145                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$14)
    3146                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    3147                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3148                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x32)
    3149                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x21)
    3150                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    3151                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    3152                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    3153                            .dwattr $C$DW$T$129, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3154                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x4e)
    3155                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x17)
    3156                    $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    3157                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$128)
    3158                            .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    3159                            .dwattr $C$DW$T$130, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3160                            .dwattr $C$DW$T$130, DW_AT_decl_line(0x40)
    3161                            .dwattr $C$DW$T$130, DW_AT_decl_column(0x17)
    3162                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    3163                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$14)
    3164                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   59

    3165                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3166                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x56)
    3167                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x20)
    3168                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3169                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3170                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3171                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3172                    $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    3173                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$15)
    3174                            .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    3175                            .dwattr $C$DW$T$132, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3176                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x1cf)
    3177                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x14)
    3178                    $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    3179                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$15)
    3180                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    3181                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3182                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x33)
    3183                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x20)
    3184                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    3185                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    3186                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3187                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3188                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x4f)
    3189                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x16)
    3190                    $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    3191                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$133)
    3192                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    3193                            .dwattr $C$DW$T$135, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3194                            .dwattr $C$DW$T$135, DW_AT_decl_line(0x41)
    3195                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x16)
    3196                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    3197                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$15)
    3198                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3199                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    3200                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x57)
    3201                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x20)
    3202                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3203                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3204                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3205                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3206                    
    3207                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    3208                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$16)
    3209                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3210                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
    3211                    $C$DW$93        .dwtag  DW_TAG_subrange_type
    3212                            .dwattr $C$DW$93, DW_AT_upper_bound(0x02)
    3213                            .dwendtag $C$DW$T$25
    3214                    
    3215                    
    3216                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    3217                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$16)
    3218                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3219                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   60

    3220                    $C$DW$94        .dwtag  DW_TAG_subrange_type
    3221                            .dwattr $C$DW$94, DW_AT_upper_bound(0x01)
    3222                            .dwendtag $C$DW$T$32
    3223                    
    3224                    
    3225                    $C$DW$T$48      .dwtag  DW_TAG_array_type
    3226                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$16)
    3227                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3228                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    3229                    $C$DW$95        .dwtag  DW_TAG_subrange_type
    3230                            .dwattr $C$DW$95, DW_AT_upper_bound(0x04)
    3231                            .dwendtag $C$DW$T$48
    3232                    
    3233                    $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("float_t")
    3234                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$16)
    3235                            .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    3236                            .dwattr $C$DW$T$138, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/math.h")
    3237                            .dwattr $C$DW$T$138, DW_AT_decl_line(0x62)
    3238                            .dwattr $C$DW$T$138, DW_AT_decl_column(0x0f)
    3239                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    3240                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3241                            .dwattr $C$DW$T$17, DW_AT_name("double")
    3242                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    3243                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("double_t")
    3244                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$17)
    3245                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    3246                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/math.h")
    3247                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x63)
    3248                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x10)
    3249                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    3250                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3251                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    3252                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    3253                    $C$DW$T$26      .dwtag  DW_TAG_base_type
    3254                            .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_unsigned_char)
    3255                            .dwattr $C$DW$T$26, DW_AT_name("unsigned char")
    3256                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3257                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    3258                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$6)
    3259                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    3260                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3261                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x23a)
    3262                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x0e)
    3263                    $C$DW$T$73      .dwtag  DW_TAG_const_type
    3264                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$6)
    3265                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    3266                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3267                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    3268                    $C$DW$T$143     .dwtag  DW_TAG_pointer_type
    3269                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$6)
    3270                            .dwattr $C$DW$T$143, DW_AT_address_class(0x20)
    3271                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("__builtin_va_list")
    3272                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
    3273                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    3274                            .dwattr $C$DW$T$144, DW_AT_decl_file("../parse.c")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   61

    3275                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x1c2)
    3276                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x01)
    3277                    
    3278                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3279                            .dwattr $C$DW$T$24, DW_AT_name("__va_list")
    3280                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    3281                    $C$DW$96        .dwtag  DW_TAG_member
    3282                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$3)
    3283                            .dwattr $C$DW$96, DW_AT_name("__ap")
    3284                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("__ap")
    3285                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3286                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    3287                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    3288                            .dwattr $C$DW$96, DW_AT_decl_line(0x32)
    3289                            .dwattr $C$DW$96, DW_AT_decl_column(0x0c)
    3290                            .dwendtag $C$DW$T$24
    3291                    
    3292                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    3293                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x31)
    3294                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    3295                    $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    3296                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$24)
    3297                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    3298                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    3299                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x33)
    3300                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x03)
    3301                    $C$DW$T$146     .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    3302                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
    3303                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    3304                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    3305                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x218)
    3306                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x17)
    3307                    
    3308                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3309                            .dwattr $C$DW$T$27, DW_AT_name("_accel")
    3310                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    3311                    $C$DW$97        .dwtag  DW_TAG_member
    3312                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$25)
    3313                            .dwattr $C$DW$97, DW_AT_name("a")
    3314                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("a")
    3315                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3316                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    3317                            .dwattr $C$DW$97, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    3318                            .dwattr $C$DW$97, DW_AT_decl_line(0x3f)
    3319                            .dwattr $C$DW$97, DW_AT_decl_column(0x09)
    3320                    $C$DW$98        .dwtag  DW_TAG_member
    3321                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$26)
    3322                            .dwattr $C$DW$98, DW_AT_name("isPresent")
    3323                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("isPresent")
    3324                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3325                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    3326                            .dwattr $C$DW$98, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    3327                            .dwattr $C$DW$98, DW_AT_decl_line(0x40)
    3328                            .dwattr $C$DW$98, DW_AT_decl_column(0x09)
    3329                            .dwendtag $C$DW$T$27
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   62

    3330                    
    3331                            .dwattr $C$DW$T$27, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    3332                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3d)
    3333                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    3334                    $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("accelerazione")
    3335                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3336                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3337                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    3338                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x42)
    3339                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    3340                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3341                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3342                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3343                    
    3344                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3345                            .dwattr $C$DW$T$33, DW_AT_name("_cinematica")
    3346                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    3347                    $C$DW$99        .dwtag  DW_TAG_member
    3348                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$29)
    3349                            .dwattr $C$DW$99, DW_AT_name("Aptr")
    3350                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("Aptr")
    3351                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3352                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    3353                            .dwattr $C$DW$99, DW_AT_decl_file("..\adc/adc.h")
    3354                            .dwattr $C$DW$99, DW_AT_decl_line(0x1d)
    3355                            .dwattr $C$DW$99, DW_AT_decl_column(0x11)
    3356                    $C$DW$100       .dwtag  DW_TAG_member
    3357                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$31)
    3358                            .dwattr $C$DW$100, DW_AT_name("distPTR")
    3359                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("distPTR")
    3360                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3361                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    3362                            .dwattr $C$DW$100, DW_AT_decl_file("..\adc/adc.h")
    3363                            .dwattr $C$DW$100, DW_AT_decl_line(0x1e)
    3364                            .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    3365                    $C$DW$101       .dwtag  DW_TAG_member
    3366                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$16)
    3367                            .dwattr $C$DW$101, DW_AT_name("vel")
    3368                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("vel")
    3369                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3370                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    3371                            .dwattr $C$DW$101, DW_AT_decl_file("..\adc/adc.h")
    3372                            .dwattr $C$DW$101, DW_AT_decl_line(0x1f)
    3373                            .dwattr $C$DW$101, DW_AT_decl_column(0x0a)
    3374                    $C$DW$102       .dwtag  DW_TAG_member
    3375                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$32)
    3376                            .dwattr $C$DW$102, DW_AT_name("spazio")
    3377                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("spazio")
    3378                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3379                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    3380                            .dwattr $C$DW$102, DW_AT_decl_file("..\adc/adc.h")
    3381                            .dwattr $C$DW$102, DW_AT_decl_line(0x20)
    3382                            .dwattr $C$DW$102, DW_AT_decl_column(0x0a)
    3383                            .dwendtag $C$DW$T$33
    3384                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   63

    3385                            .dwattr $C$DW$T$33, DW_AT_decl_file("..\adc/adc.h")
    3386                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1c)
    3387                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3388                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("cinematica")
    3389                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$33)
    3390                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3391                            .dwattr $C$DW$T$41, DW_AT_decl_file("..\adc/adc.h")
    3392                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x21)
    3393                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    3394                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    3395                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3396                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    3397                    
    3398                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3399                            .dwattr $C$DW$T$34, DW_AT_name("_colore")
    3400                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    3401                    $C$DW$103       .dwtag  DW_TAG_member
    3402                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$10)
    3403                            .dwattr $C$DW$103, DW_AT_name("rosso")
    3404                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("rosso")
    3405                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3406                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    3407                            .dwattr $C$DW$103, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3408                            .dwattr $C$DW$103, DW_AT_decl_line(0x21)
    3409                            .dwattr $C$DW$103, DW_AT_decl_column(0x06)
    3410                    $C$DW$104       .dwtag  DW_TAG_member
    3411                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$10)
    3412                            .dwattr $C$DW$104, DW_AT_name("verde")
    3413                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("verde")
    3414                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3415                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    3416                            .dwattr $C$DW$104, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3417                            .dwattr $C$DW$104, DW_AT_decl_line(0x22)
    3418                            .dwattr $C$DW$104, DW_AT_decl_column(0x06)
    3419                    $C$DW$105       .dwtag  DW_TAG_member
    3420                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$10)
    3421                            .dwattr $C$DW$105, DW_AT_name("blu")
    3422                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("blu")
    3423                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3424                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    3425                            .dwattr $C$DW$105, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3426                            .dwattr $C$DW$105, DW_AT_decl_line(0x23)
    3427                            .dwattr $C$DW$105, DW_AT_decl_column(0x06)
    3428                    $C$DW$106       .dwtag  DW_TAG_member
    3429                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$10)
    3430                            .dwattr $C$DW$106, DW_AT_name("luminanza")
    3431                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("luminanza")
    3432                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3433                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    3434                            .dwattr $C$DW$106, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3435                            .dwattr $C$DW$106, DW_AT_decl_line(0x24)
    3436                            .dwattr $C$DW$106, DW_AT_decl_column(0x06)
    3437                    $C$DW$107       .dwtag  DW_TAG_member
    3438                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$10)
    3439                            .dwattr $C$DW$107, DW_AT_name("bianco")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   64

    3440                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("bianco")
    3441                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3442                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    3443                            .dwattr $C$DW$107, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3444                            .dwattr $C$DW$107, DW_AT_decl_line(0x25)
    3445                            .dwattr $C$DW$107, DW_AT_decl_column(0x06)
    3446                            .dwendtag $C$DW$T$34
    3447                    
    3448                            .dwattr $C$DW$T$34, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3449                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x20)
    3450                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    3451                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("colore")
    3452                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$34)
    3453                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3454                            .dwattr $C$DW$T$39, DW_AT_decl_file("..\sens_col_ir/sens.h")
    3455                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x26)
    3456                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    3457                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3458                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3459                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3460                    
    3461                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3462                            .dwattr $C$DW$T$47, DW_AT_name("_dati")
    3463                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x1c)
    3464                    $C$DW$108       .dwtag  DW_TAG_member
    3465                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$36)
    3466                            .dwattr $C$DW$108, DW_AT_name("gPtr")
    3467                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("gPtr")
    3468                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3469                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    3470                            .dwattr $C$DW$108, DW_AT_decl_file("..\init.h")
    3471                            .dwattr $C$DW$108, DW_AT_decl_line(0x42)
    3472                            .dwattr $C$DW$108, DW_AT_decl_column(0x0a)
    3473                    $C$DW$109       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$38)
    3475                            .dwattr $C$DW$109, DW_AT_name("tempPtr")
    3476                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("tempPtr")
    3477                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3478                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$109, DW_AT_decl_file("..\init.h")
    3480                            .dwattr $C$DW$109, DW_AT_decl_line(0x43)
    3481                            .dwattr $C$DW$109, DW_AT_decl_column(0x0f)
    3482                    $C$DW$110       .dwtag  DW_TAG_member
    3483                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$40)
    3484                            .dwattr $C$DW$110, DW_AT_name("colPtr")
    3485                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("colPtr")
    3486                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3487                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    3488                            .dwattr $C$DW$110, DW_AT_decl_file("..\init.h")
    3489                            .dwattr $C$DW$110, DW_AT_decl_line(0x44)
    3490                            .dwattr $C$DW$110, DW_AT_decl_column(0x0c)
    3491                    $C$DW$111       .dwtag  DW_TAG_member
    3492                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$31)
    3493                            .dwattr $C$DW$111, DW_AT_name("distPtr")
    3494                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("distPtr")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   65

    3495                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3496                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    3497                            .dwattr $C$DW$111, DW_AT_decl_file("..\init.h")
    3498                            .dwattr $C$DW$111, DW_AT_decl_line(0x45)
    3499                            .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    3500                    $C$DW$112       .dwtag  DW_TAG_member
    3501                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$42)
    3502                            .dwattr $C$DW$112, DW_AT_name("cinPtr")
    3503                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("cinPtr")
    3504                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3505                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    3506                            .dwattr $C$DW$112, DW_AT_decl_file("..\init.h")
    3507                            .dwattr $C$DW$112, DW_AT_decl_line(0x46)
    3508                            .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
    3509                    $C$DW$113       .dwtag  DW_TAG_member
    3510                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$44)
    3511                            .dwattr $C$DW$113, DW_AT_name("qeiPtr")
    3512                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("qeiPtr")
    3513                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3514                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    3515                            .dwattr $C$DW$113, DW_AT_decl_file("..\init.h")
    3516                            .dwattr $C$DW$113, DW_AT_decl_line(0x47)
    3517                            .dwattr $C$DW$113, DW_AT_decl_column(0x09)
    3518                    $C$DW$114       .dwtag  DW_TAG_member
    3519                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$46)
    3520                            .dwattr $C$DW$114, DW_AT_name("surPtr")
    3521                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("surPtr")
    3522                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3523                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    3524                            .dwattr $C$DW$114, DW_AT_decl_file("..\init.h")
    3525                            .dwattr $C$DW$114, DW_AT_decl_line(0x48)
    3526                            .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    3527                            .dwendtag $C$DW$T$47
    3528                    
    3529                            .dwattr $C$DW$T$47, DW_AT_decl_file("..\init.h")
    3530                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x41)
    3531                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3532                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("dati")
    3533                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$47)
    3534                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3535                            .dwattr $C$DW$T$81, DW_AT_decl_file("..\init.h")
    3536                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x49)
    3537                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    3538                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3539                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    3540                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3541                    
    3542                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3543                            .dwattr $C$DW$T$52, DW_AT_name("_dist")
    3544                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x50)
    3545                    $C$DW$115       .dwtag  DW_TAG_member
    3546                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$48)
    3547                            .dwattr $C$DW$115, DW_AT_name("misSens")
    3548                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("misSens")
    3549                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   66

    3550                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    3551                            .dwattr $C$DW$115, DW_AT_decl_file("..\adc/adc.h")
    3552                            .dwattr $C$DW$115, DW_AT_decl_line(0x12)
    3553                            .dwattr $C$DW$115, DW_AT_decl_column(0x0a)
    3554                    $C$DW$116       .dwtag  DW_TAG_member
    3555                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$16)
    3556                            .dwattr $C$DW$116, DW_AT_name("kf")
    3557                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("kf")
    3558                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3559                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    3560                            .dwattr $C$DW$116, DW_AT_decl_file("..\adc/adc.h")
    3561                            .dwattr $C$DW$116, DW_AT_decl_line(0x13)
    3562                            .dwattr $C$DW$116, DW_AT_decl_column(0x0a)
    3563                    $C$DW$117       .dwtag  DW_TAG_member
    3564                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$49)
    3565                            .dwattr $C$DW$117, DW_AT_name("d_mm")
    3566                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("d_mm")
    3567                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3568                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    3569                            .dwattr $C$DW$117, DW_AT_decl_file("..\adc/adc.h")
    3570                            .dwattr $C$DW$117, DW_AT_decl_line(0x14)
    3571                            .dwattr $C$DW$117, DW_AT_decl_column(0x08)
    3572                    $C$DW$118       .dwtag  DW_TAG_member
    3573                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$51)
    3574                            .dwattr $C$DW$118, DW_AT_name("dI")
    3575                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("dI")
    3576                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3577                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    3578                            .dwattr $C$DW$118, DW_AT_decl_file("..\adc/adc.h")
    3579                            .dwattr $C$DW$118, DW_AT_decl_line(0x15)
    3580                            .dwattr $C$DW$118, DW_AT_decl_column(0x0b)
    3581                    $C$DW$119       .dwtag  DW_TAG_member
    3582                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$26)
    3583                            .dwattr $C$DW$119, DW_AT_name("run")
    3584                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("run")
    3585                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3586                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    3587                            .dwattr $C$DW$119, DW_AT_decl_file("..\adc/adc.h")
    3588                            .dwattr $C$DW$119, DW_AT_decl_line(0x16)
    3589                            .dwattr $C$DW$119, DW_AT_decl_column(0x08)
    3590                            .dwendtag $C$DW$T$52
    3591                    
    3592                            .dwattr $C$DW$T$52, DW_AT_decl_file("..\adc/adc.h")
    3593                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x10)
    3594                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3595                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("distanza")
    3596                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$52)
    3597                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3598                            .dwattr $C$DW$T$30, DW_AT_decl_file("..\adc/adc.h")
    3599                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x18)
    3600                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    3601                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    3602                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3603                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    3604                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   67

    3605                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3606                            .dwattr $C$DW$T$55, DW_AT_name("_gyro")
    3607                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x40)
    3608                    $C$DW$120       .dwtag  DW_TAG_member
    3609                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$6)
    3610                            .dwattr $C$DW$120, DW_AT_name("IsPresent")
    3611                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("IsPresent")
    3612                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    3614                            .dwattr $C$DW$120, DW_AT_decl_file("..\gyro_f.h")
    3615                            .dwattr $C$DW$120, DW_AT_decl_line(0x11)
    3616                            .dwattr $C$DW$120, DW_AT_decl_column(0x07)
    3617                    $C$DW$121       .dwtag  DW_TAG_member
    3618                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$6)
    3619                            .dwattr $C$DW$121, DW_AT_name("IsOn")
    3620                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("IsOn")
    3621                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3622                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    3623                            .dwattr $C$DW$121, DW_AT_decl_file("..\gyro_f.h")
    3624                            .dwattr $C$DW$121, DW_AT_decl_line(0x12)
    3625                            .dwattr $C$DW$121, DW_AT_decl_column(0x07)
    3626                    $C$DW$122       .dwtag  DW_TAG_member
    3627                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$54)
    3628                            .dwattr $C$DW$122, DW_AT_name("x0")
    3629                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("x0")
    3630                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3631                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    3632                            .dwattr $C$DW$122, DW_AT_decl_file("..\gyro_f.h")
    3633                            .dwattr $C$DW$122, DW_AT_decl_line(0x14)
    3634                            .dwattr $C$DW$122, DW_AT_decl_column(0x0a)
    3635                    $C$DW$123       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$54)
    3637                            .dwattr $C$DW$123, DW_AT_name("y0")
    3638                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("y0")
    3639                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3640                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    3641                            .dwattr $C$DW$123, DW_AT_decl_file("..\gyro_f.h")
    3642                            .dwattr $C$DW$123, DW_AT_decl_line(0x14)
    3643                            .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    3644                    $C$DW$124       .dwtag  DW_TAG_member
    3645                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$54)
    3646                            .dwattr $C$DW$124, DW_AT_name("z0")
    3647                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("z0")
    3648                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3649                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    3650                            .dwattr $C$DW$124, DW_AT_decl_file("..\gyro_f.h")
    3651                            .dwattr $C$DW$124, DW_AT_decl_line(0x14)
    3652                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    3653                    $C$DW$125       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$6)
    3655                            .dwattr $C$DW$125, DW_AT_name("asseOn")
    3656                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("asseOn")
    3657                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3658                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$125, DW_AT_decl_file("..\gyro_f.h")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   68

    3660                            .dwattr $C$DW$125, DW_AT_decl_line(0x16)
    3661                            .dwattr $C$DW$125, DW_AT_decl_column(0x07)
    3662                    $C$DW$126       .dwtag  DW_TAG_member
    3663                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$54)
    3664                            .dwattr $C$DW$126, DW_AT_name("yaw")
    3665                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("yaw")
    3666                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3667                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    3668                            .dwattr $C$DW$126, DW_AT_decl_file("..\gyro_f.h")
    3669                            .dwattr $C$DW$126, DW_AT_decl_line(0x19)
    3670                            .dwattr $C$DW$126, DW_AT_decl_column(0x0a)
    3671                    $C$DW$127       .dwtag  DW_TAG_member
    3672                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$54)
    3673                            .dwattr $C$DW$127, DW_AT_name("roll")
    3674                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("roll")
    3675                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3676                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    3677                            .dwattr $C$DW$127, DW_AT_decl_file("..\gyro_f.h")
    3678                            .dwattr $C$DW$127, DW_AT_decl_line(0x1a)
    3679                            .dwattr $C$DW$127, DW_AT_decl_column(0x0a)
    3680                    $C$DW$128       .dwtag  DW_TAG_member
    3681                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$54)
    3682                            .dwattr $C$DW$128, DW_AT_name("pitch")
    3683                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("pitch")
    3684                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3685                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    3686                            .dwattr $C$DW$128, DW_AT_decl_file("..\gyro_f.h")
    3687                            .dwattr $C$DW$128, DW_AT_decl_line(0x1b)
    3688                            .dwattr $C$DW$128, DW_AT_decl_column(0x0a)
    3689                    $C$DW$129       .dwtag  DW_TAG_member
    3690                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$16)
    3691                            .dwattr $C$DW$129, DW_AT_name("yawF")
    3692                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("yawF")
    3693                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3694                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    3695                            .dwattr $C$DW$129, DW_AT_decl_file("..\gyro_f.h")
    3696                            .dwattr $C$DW$129, DW_AT_decl_line(0x1e)
    3697                            .dwattr $C$DW$129, DW_AT_decl_column(0x08)
    3698                    $C$DW$130       .dwtag  DW_TAG_member
    3699                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$16)
    3700                            .dwattr $C$DW$130, DW_AT_name("rollF")
    3701                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("rollF")
    3702                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3703                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    3704                            .dwattr $C$DW$130, DW_AT_decl_file("..\gyro_f.h")
    3705                            .dwattr $C$DW$130, DW_AT_decl_line(0x1f)
    3706                            .dwattr $C$DW$130, DW_AT_decl_column(0x08)
    3707                    $C$DW$131       .dwtag  DW_TAG_member
    3708                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$16)
    3709                            .dwattr $C$DW$131, DW_AT_name("pitchF")
    3710                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("pitchF")
    3711                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3712                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    3713                            .dwattr $C$DW$131, DW_AT_decl_file("..\gyro_f.h")
    3714                            .dwattr $C$DW$131, DW_AT_decl_line(0x20)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:32 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
parse.asm                                                            PAGE   69

    3715                            .dwattr $C$DW$131, DW_AT_decl_column(0x08)
    3716                    $C$DW$132       .dwtag  DW_TAG_member
    3717                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$16)
    3718                            .dwattr $C$DW$132, DW_AT_name("yawP")
    3719                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("yawP")
    3720                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3721                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    3722                            .dwattr $C$DW$132, DW_AT_decl_file("..\gyro_f.h")
    3723                            .dwattr $C$DW$132, DW_AT_decl_line(0x22)
    3724                            .dwattr $C$DW$132, DW_AT_decl_column(0x08)
    3725                    $C$DW$133       .dwtag  DW_TAG_member
    3726                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$16)
    3727                            .dwattr $C$DW$133, DW_AT_name("rollP")
    3728                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("rollP")
    3729                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3730                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    3731                            .dwattr $C$DW$133, DW_AT_decl_file("..\gyro_f.h")
    3732                            .dwattr $C$DW$133, DW_AT_decl_line(0x22)
    3733                            .dwattr $C$DW$133, DW_AT_decl_column(0x0e)
    3734                    $C$DW$134       .dwtag  DW_TAG_member
    3735                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$16)
    3736                            .dwattr $C$DW$134, DW_AT_name("pitchP")
    3737                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("pitchP")
    3738                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3739                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    3740                            .dwattr $C$DW$134, DW_AT_decl_file("..\gyro_f.h")
    3741                            .dwattr $C$DW$134, DW_AT_decl_line(0x22)
    3742                            .dwattr $C$DW$134, DW_AT_decl_column(0x15)
    3743                    $C$DW$135       .dwtag  DW_TAG_member
    3744                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$54)
    3745                            .dwattr $C$DW$135, DW_AT_name("gradiSec")
    3746                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("gradiSec")
    3747                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3748                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    3749                            .dwattr $C$DW$135, DW_AT_decl_file("..\gyro_f.h")
    3750                            .dwattr $C$DW$135, DW_AT_decl_line(0x24)
    3751                            .dwattr $C$DW$135, DW_AT_decl_column(0x0a)
    3752                    $C$DW$136       .dwtag  DW_TAG_member
    3753                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$16)
    3754                            .dwattr $C$DW$136, DW_AT_name("FS")
    3755                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("FS")
    3756                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3757                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    3758                            .dwattr $C$DW$136, DW_AT_decl_file("..\gyro_f.h")
    3759                            .dwattr $C$DW$136, DW_AT_decl_line(0x25)
    3760                            .dwattr $C$DW$136, DW_AT_decl_column(0x08)
    3761                    $C$DW$137       .dwtag  DW_TAG_member
    3762                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$16)
    3763                            .dwattr $C$DW$137, DW_AT_name("tick")
    3764                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("tick")
    3765                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3766                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    3767                            .dwattr $C$DW$137, DW_AT_decl_file("..\gyro_f.h")
    3768                            .dwattr $C$DW$137, DW_AT_decl_line(0x27)
