TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.6 *
       3                    ;* Date/Time created: Wed Feb 10 23:08:33 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disabl
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../pid.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.6 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti6\workspace\tiva-pid\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("abs")
      15                            .dwattr $C$DW$1, DW_AT_TI_symbol_name("abs")

    1216                    ;----------------------------------------------------------------------
    1217                    ; 172 | C->e[0] = C->e[1];                                                     
    1218                    ;----------------------------------------------------------------------
    1219 00000366 9800              LDR       A1, [SP, #0]          ; [DPU_3_PIPE] |172|  ; [ORIG 16-BIT INS]
    1220 00000368 9900              LDR       A2, [SP, #0]          ; [DPU_3_PIPE] |172|  ; [ORIG 16-BIT INS]
    1221 0000036a 6900              LDR       A1, [A1, #16]         ; [DPU_3_PIPE] |172|  ; [ORIG 16-BIT INS]
    1222 0000036c 60C8              STR       A1, [A2, #12]         ; [DPU_3_PIPE] |172|  ; [ORIG 16-BIT INS]
    1223                            .dwpsn  file "../pid.c",line 173,column 1,is_stmt,isa 1
    1224 0000036e B006              ADD       SP, SP, #24           ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
    1225                            .dwcfi  cfa_offset, 0
    1226                    $C$DW$64        .dwtag  DW_TAG_TI_branch
    1227                            .dwattr $C$DW$64, DW_AT_low_pc(0x00)
    1228                            .dwattr $C$DW$64, DW_AT_TI_return
    1229 00000370 4770              BX        LR                    ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
    1230                            ; BRANCH OCCURS                  ; [] 
    1231                            .dwattr $C$DW$56, DW_AT_TI_end_file("../pid.c")
    1232                            .dwattr $C$DW$56, DW_AT_TI_end_line(0xad)
    1233                            .dwattr $C$DW$56, DW_AT_TI_end_column(0x01)
    1234                            .dwendentry
    1235                            .dwendtag $C$DW$56
    1236                    
    1237                    ;******************************************************************************
    1238                    ;* FLOATING-POINT CONSTANTS                                                   *
    1239                    ;******************************************************************************
    1240 00000372                   .sect   ".text"
    1241                            .align  4
    1242 00000374 00000000  ||$C$FL3||:     .word   000000000h      ; 0
    1243                            .align  4
    1244 00000378 3D4CCCCD  ||$C$FL4||:     .word   03d4ccccdh      ; 0.05000000074505805969
    1245                            .align  4
    1246 0000037c 60418937  ||$C$FL5||:     .word   060418937h
    1247 00000380 3FD2D0E5          .word   03fd2d0e5h      ; 0.29399999999999998357
    1248                            .align  4
    1249 00000384 E147AE14  ||$C$FL6||:     .word   0e147ae14h
    1250 00000388 4050C47A          .word   04050c47ah      ; 67.06999999999999317879
    1251                            .align  4
    1252 0000038c 42C80000  ||$C$FL7||:     .word   042c80000h      ; 100
    1253                            .align  4
    1254 00000390 C2C80000  ||$C$FL8||:     .word   0c2c80000h      ; -100
    1255                    ;*****************************************************************************
    1256                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1257                    ;*****************************************************************************
    1258                            .global misuraAngoli
    1259                            .global pwm_power
    1260                            .global __aeabi_f2d
    1261                            .global __aeabi_dmul
    1262                            .global __aeabi_dadd
    1263                            .global __aeabi_d2f
    1264                    
    1265                    ;******************************************************************************
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   24

    1266                    ;* BUILD ATTRIBUTES                                                           *
    1267                    ;******************************************************************************
    1268                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
    1269                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
    1270                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
    1271                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
    1272                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
    1273                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
    1274                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
    1275                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1276                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1277                            .battr "TI", Tag_File, 1, Tag_FP_interface(0)
    1278                    
    1279                    ;******************************************************************************
    1280                    ;* TYPE INFORMATION                                                           *
    1281                    ;******************************************************************************
    1282                    
    1283                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1284                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    1285                    $C$DW$65        .dwtag  DW_TAG_member
    1286                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$10)
    1287                            .dwattr $C$DW$65, DW_AT_name("quot")
    1288                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("quot")
    1289                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1291                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1292                            .dwattr $C$DW$65, DW_AT_decl_line(0x50)
    1293                            .dwattr $C$DW$65, DW_AT_decl_column(0x16)
    1294                    $C$DW$66        .dwtag  DW_TAG_member
    1295                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$10)
    1296                            .dwattr $C$DW$66, DW_AT_name("rem")
    1297                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("rem")
    1298                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1299                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1300                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1301                            .dwattr $C$DW$66, DW_AT_decl_line(0x50)
    1302                            .dwattr $C$DW$66, DW_AT_decl_column(0x1c)
    1303                            .dwendtag $C$DW$T$19
    1304                    
    1305                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1306                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x50)
    1307                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1308                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    1309                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$19)
    1310                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1311                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1312                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
    1313                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x23)
    1314                    
    1315                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1316                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    1317                    $C$DW$67        .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
    1319                            .dwattr $C$DW$67, DW_AT_name("quot")
    1320                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("quot")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   25

    1321                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1324                            .dwattr $C$DW$67, DW_AT_decl_line(0x52)
    1325                            .dwattr $C$DW$67, DW_AT_decl_column(0x16)
    1326                    $C$DW$68        .dwtag  DW_TAG_member
    1327                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
    1328                            .dwattr $C$DW$68, DW_AT_name("rem")
    1329                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rem")
    1330                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1331                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1332                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1333                            .dwattr $C$DW$68, DW_AT_decl_line(0x52)
    1334                            .dwattr $C$DW$68, DW_AT_decl_column(0x1c)
    1335                            .dwendtag $C$DW$T$20
    1336                    
    1337                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1338                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x52)
    1339                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1340                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    1341                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$20)
    1342                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1343                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1344                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x52)
    1345                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x23)
    1346                    
    1347                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1348                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1349                    $C$DW$69        .dwtag  DW_TAG_member
    1350                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$14)
    1351                            .dwattr $C$DW$69, DW_AT_name("quot")
    1352                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("quot")
    1353                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1355                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1356                            .dwattr $C$DW$69, DW_AT_decl_line(0x55)
    1357                            .dwattr $C$DW$69, DW_AT_decl_column(0x1c)
    1358                    $C$DW$70        .dwtag  DW_TAG_member
    1359                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$14)
    1360                            .dwattr $C$DW$70, DW_AT_name("rem")
    1361                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rem")
    1362                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1363                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1364                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1365                            .dwattr $C$DW$70, DW_AT_decl_line(0x55)
    1366                            .dwattr $C$DW$70, DW_AT_decl_column(0x22)
    1367                            .dwendtag $C$DW$T$21
    1368                    
    1369                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1370                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
    1371                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1372                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1373                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$21)
    1374                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1375                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   26

    1376                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x55)
    1377                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x29)
    1378                    
    1379                    $C$DW$T$23      .dwtag  DW_TAG_union_type
    1380                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    1381                    $C$DW$71        .dwtag  DW_TAG_member
    1382                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1383                            .dwattr $C$DW$71, DW_AT_name("_Word")
    1384                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Word")
    1385                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1387                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    1388                            .dwattr $C$DW$71, DW_AT_decl_line(0x81)
    1389                            .dwattr $C$DW$71, DW_AT_decl_column(0x11)
    1390                    $C$DW$72        .dwtag  DW_TAG_member
    1391                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$16)
    1392                            .dwattr $C$DW$72, DW_AT_name("_Float")
    1393                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Float")
    1394                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1396                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    1397                            .dwattr $C$DW$72, DW_AT_decl_line(0x82)
    1398                            .dwattr $C$DW$72, DW_AT_decl_column(0x08)
    1399                    $C$DW$73        .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$17)
    1401                            .dwattr $C$DW$73, DW_AT_name("_Double")
    1402                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Double")
    1403                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1405                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    1406                            .dwattr $C$DW$73, DW_AT_decl_line(0x83)
    1407                            .dwattr $C$DW$73, DW_AT_decl_column(0x09)
    1408                    $C$DW$74        .dwtag  DW_TAG_member
    1409                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$18)
    1410                            .dwattr $C$DW$74, DW_AT_name("_Long_double")
    1411                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Long_double")
    1412                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1414                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    1415                            .dwattr $C$DW$74, DW_AT_decl_line(0x84)
    1416                            .dwattr $C$DW$74, DW_AT_decl_column(0x0e)
    1417                            .dwendtag $C$DW$T$23
    1418                    
    1419                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    1420                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x80)
    1421                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x02)
    1422                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
    1423                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$23)
    1424                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1425                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
    1426                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x85)
    1427                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x04)
    1428                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1429                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1430                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   27

    1431                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1432                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1433                    
    1434                    $C$DW$T$86      .dwtag  DW_TAG_subroutine_type
    1435                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1436                    $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    1437                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1438                            .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    1439                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("__TI_atexit_fn")
    1440                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1441                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1442                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1443                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xa3)
    1444                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x14)
    1445                    $C$DW$T$89      .dwtag  DW_TAG_const_type
    1446                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$2)
    1447                    $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    1448                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1449                            .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    1450                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1451                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1452                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1453                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1454                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1455                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1456                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1457                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1458                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    1459                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$5)
    1460                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1461                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1462                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x2a)
    1463                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x1d)
    1464                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    1465                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1466                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1467                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1468                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x37)
    1469                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x17)
    1470                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1471                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1472                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1473                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1474                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    1475                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$6)
    1476                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1477                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1478                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x2b)
    1479                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x1c)
    1480                    
    1481                    $C$DW$T$61      .dwtag  DW_TAG_array_type
    1482                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$56)
    1483                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1484                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    1485                    $C$DW$75        .dwtag  DW_TAG_subrange_type
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   28

    1486                            .dwattr $C$DW$75, DW_AT_upper_bound(0x03)
    1487                            .dwendtag $C$DW$T$61
    1488                    
    1489                    
    1490                    $C$DW$T$63      .dwtag  DW_TAG_array_type
    1491                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$56)
    1492                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1493                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    1494                    $C$DW$76        .dwtag  DW_TAG_subrange_type
    1495                            .dwattr $C$DW$76, DW_AT_upper_bound(0x07)
    1496                            .dwendtag $C$DW$T$63
    1497                    
    1498                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    1499                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$56)
    1500                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1501                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1502                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x38)
    1503                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x16)
    1504                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1505                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1506                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1507                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1508                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1509                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1510                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1511                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1512                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    1513                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
    1514                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1515                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1516                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2c)
    1517                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x1d)
    1518                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    1519                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$54)
    1520                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1521                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1522                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x3a)
    1523                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x17)
    1524                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1525                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1526                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1527                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1528                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    1529                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$9)
    1530                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1531                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1532                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x1fe)
    1533                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x21)
    1534                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    1535                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$9)
    1536                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    1537                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1538                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x1ff)
    1539                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x21)
    1540                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   29

    1541                    $C$DW$T$22      .dwtag  DW_TAG_array_type
    1542                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    1543                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1544                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    1545                    $C$DW$77        .dwtag  DW_TAG_subrange_type
    1546                            .dwattr $C$DW$77, DW_AT_upper_bound(0x07)
    1547                            .dwendtag $C$DW$T$22
    1548                    
    1549                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1550                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$9)
    1551                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1552                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1553                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2d)
    1554                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x1c)
    1555                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    1556                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$62)
    1557                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1558                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1559                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x3b)
    1560                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x16)
    1561                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1562                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$9)
    1563                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1564                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1565                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x6a)
    1566                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x1a)
    1567                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1568                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1569                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1570                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1571                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    1572                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$10)
    1573                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1574                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1575                            .dwattr $C$DW$T$99, DW_AT_decl_line(0xa6)
    1576                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x1e)
    1577                    
    1578                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    1579                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$10)
    1580                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1581                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
    1582                    $C$DW$78        .dwtag  DW_TAG_subrange_type
    1583                            .dwattr $C$DW$78, DW_AT_upper_bound(0x04)
    1584                            .dwendtag $C$DW$T$49
    1585                    
    1586                    
    1587                    $C$DW$T$102     .dwtag  DW_TAG_subroutine_type
    1588                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$10)
    1589                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    1590                    $C$DW$79        .dwtag  DW_TAG_formal_parameter
    1591                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$90)
    1592                    $C$DW$80        .dwtag  DW_TAG_formal_parameter
    1593                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$90)
    1594                            .dwendtag $C$DW$T$102
    1595                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   30

    1596                    $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    1597                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    1598                            .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    1599                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("__TI_compar_fn")
    1600                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    1601                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    1602                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1603                            .dwattr $C$DW$T$104, DW_AT_decl_line(0xa6)
    1604                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x13)
    1605                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    1606                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$10)
    1607                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    1608                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1609                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x2e)
    1610                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1d)
    1611                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    1612                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    1613                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    1614                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1615                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x47)
    1616                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x17)
    1617                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    1618                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$105)
    1619                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    1620                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1621                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x4a)
    1622                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x17)
    1623                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    1624                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$105)
    1625                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    1626                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1627                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x45)
    1628                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x17)
    1629                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    1630                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$105)
    1631                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1632                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1633                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x3c)
    1634                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    1635                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    1636                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$10)
    1637                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    1638                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1639                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x52)
    1640                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x1a)
    1641                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1642                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1643                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1644                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1645                    $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    1646                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$11)
    1647                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    1648                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1649                            .dwattr $C$DW$T$111, DW_AT_decl_line(0xac)
    1650                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x1a)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   31

    1651                    $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1652                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$11)
    1653                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    1654                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdlib.h")
    1655                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x64)
    1656                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x19)
    1657                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    1658                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$11)
    1659                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1660                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1661                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2f)
    1662                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1c)
    1663                    
    1664                    $C$DW$T$51      .dwtag  DW_TAG_array_type
    1665                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1666                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1667                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x20)
    1668                    $C$DW$81        .dwtag  DW_TAG_subrange_type
    1669                            .dwattr $C$DW$81, DW_AT_upper_bound(0x07)
    1670                            .dwendtag $C$DW$T$51
    1671                    
    1672                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    1673                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$50)
    1674                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    1675                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1676                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x48)
    1677                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x16)
    1678                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    1679                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$50)
    1680                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    1681                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1682                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x4b)
    1683                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x16)
    1684                    $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    1685                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$50)
    1686                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    1687                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1688                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x46)
    1689                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x16)
    1690                    $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    1691                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$50)
    1692                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    1693                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1694                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x3d)
    1695                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x16)
    1696                    $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    1697                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$11)
    1698                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    1699                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1700                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x53)
    1701                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x1a)
    1702                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1703                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1704                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1705                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   32

    1706                    $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    1707                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$12)
    1708                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    1709                            .dwattr $C$DW$T$118, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1710                            .dwattr $C$DW$T$118, DW_AT_decl_line(0xa2)
    1711                            .dwattr $C$DW$T$118, DW_AT_decl_column(0x0e)
    1712                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1713                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1714                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1715                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1716                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    1717                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$13)
    1718                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    1719                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1720                            .dwattr $C$DW$T$119, DW_AT_decl_line(0xa3)
    1721                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x17)
    1722                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1723                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1724                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1725                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1726                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    1727                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$14)
    1728                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    1729                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1730                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x1ce)
    1731                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x13)
    1732                    $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    1733                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$14)
    1734                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    1735                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1736                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x32)
    1737                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x21)
    1738                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    1739                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    1740                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    1741                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1742                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x4e)
    1743                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x17)
    1744                    $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    1745                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$121)
    1746                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    1747                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1748                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x40)
    1749                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x17)
    1750                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    1751                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$14)
    1752                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    1753                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1754                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x56)
    1755                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x20)
    1756                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1757                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1758                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1759                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1760                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   33

    1761                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$15)
    1762                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    1763                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1764                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x1cf)
    1765                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x14)
    1766                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    1767                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$15)
    1768                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    1769                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1770                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x33)
    1771                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x20)
    1772                    $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    1773                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
    1774                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    1775                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1776                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x4f)
    1777                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x16)
    1778                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    1779                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$126)
    1780                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    1781                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1782                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x41)
    1783                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x16)
    1784                    $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    1785                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$15)
    1786                            .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    1787                            .dwattr $C$DW$T$129, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1788                            .dwattr $C$DW$T$129, DW_AT_decl_line(0x57)
    1789                            .dwattr $C$DW$T$129, DW_AT_decl_column(0x20)
    1790                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1791                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1792                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1793                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1794                    
    1795                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    1796                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$16)
    1797                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1798                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
    1799                    $C$DW$82        .dwtag  DW_TAG_subrange_type
    1800                            .dwattr $C$DW$82, DW_AT_upper_bound(0x02)
    1801                            .dwendtag $C$DW$T$25
    1802                    
    1803                    
    1804                    $C$DW$T$32      .dwtag  DW_TAG_array_type
    1805                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$16)
    1806                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1807                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    1808                    $C$DW$83        .dwtag  DW_TAG_subrange_type
    1809                            .dwattr $C$DW$83, DW_AT_upper_bound(0x01)
    1810                            .dwendtag $C$DW$T$32
    1811                    
    1812                    
    1813                    $C$DW$T$48      .dwtag  DW_TAG_array_type
    1814                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$16)
    1815                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   34

    1816                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    1817                    $C$DW$84        .dwtag  DW_TAG_subrange_type
    1818                            .dwattr $C$DW$84, DW_AT_upper_bound(0x04)
    1819                            .dwendtag $C$DW$T$48
    1820                    
    1821                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("float_t")
    1822                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$16)
    1823                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    1824                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/math.h")
    1825                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x62)
    1826                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x0f)
    1827                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1828                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1829                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1830                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1831                    $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("double_t")
    1832                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$17)
    1833                            .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    1834                            .dwattr $C$DW$T$132, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/math.h")
    1835                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x63)
    1836                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x10)
    1837                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1838                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1839                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1840                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1841                    $C$DW$T$26      .dwtag  DW_TAG_base_type
    1842                            .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_unsigned_char)
    1843                            .dwattr $C$DW$T$26, DW_AT_name("unsigned char")
    1844                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1845                    $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    1846                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$6)
    1847                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    1848                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1849                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x23a)
    1850                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x0e)
    1851                    $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    1852                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$6)
    1853                            .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    1854                    $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("__builtin_va_list")
    1855                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    1856                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    1857                            .dwattr $C$DW$T$135, DW_AT_decl_file("../pid.c")
    1858                            .dwattr $C$DW$T$135, DW_AT_decl_line(0xad)
    1859                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x01)
    1860                    
    1861                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1862                            .dwattr $C$DW$T$24, DW_AT_name("__va_list")
    1863                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1864                    $C$DW$85        .dwtag  DW_TAG_member
    1865                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$3)
    1866                            .dwattr $C$DW$85, DW_AT_name("__ap")
    1867                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("__ap")
    1868                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1870                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   35

    1871                            .dwattr $C$DW$85, DW_AT_decl_line(0x32)
    1872                            .dwattr $C$DW$85, DW_AT_decl_column(0x0c)
    1873                            .dwendtag $C$DW$T$24
    1874                    
    1875                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    1876                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x31)
    1877                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1878                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1879                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$24)
    1880                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    1881                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    1882                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x33)
    1883                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x03)
    1884                    $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    1885                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    1886                            .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    1887                            .dwattr $C$DW$T$137, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1888                            .dwattr $C$DW$T$137, DW_AT_decl_line(0x218)
    1889                            .dwattr $C$DW$T$137, DW_AT_decl_column(0x17)
    1890                    
    1891                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1892                            .dwattr $C$DW$T$27, DW_AT_name("_accel")
    1893                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x10)
    1894                    $C$DW$86        .dwtag  DW_TAG_member
    1895                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1896                            .dwattr $C$DW$86, DW_AT_name("a")
    1897                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("a")
    1898                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1900                            .dwattr $C$DW$86, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    1901                            .dwattr $C$DW$86, DW_AT_decl_line(0x3f)
    1902                            .dwattr $C$DW$86, DW_AT_decl_column(0x09)
    1903                    $C$DW$87        .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$26)
    1905                            .dwattr $C$DW$87, DW_AT_name("isPresent")
    1906                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("isPresent")
    1907                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1908                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$87, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    1910                            .dwattr $C$DW$87, DW_AT_decl_line(0x40)
    1911                            .dwattr $C$DW$87, DW_AT_decl_column(0x09)
    1912                            .dwendtag $C$DW$T$27
    1913                    
    1914                            .dwattr $C$DW$T$27, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    1915                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3d)
    1916                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    1917                    $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("accelerazione")
    1918                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1919                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1920                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\adc\../accel/accel_init.h")
    1921                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x42)
    1922                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1923                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1924                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1925                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   36

    1926                    
    1927                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1928                            .dwattr $C$DW$T$33, DW_AT_name("_cinematica")
    1929                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x14)
    1930                    $C$DW$88        .dwtag  DW_TAG_member
    1931                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$29)
    1932                            .dwattr $C$DW$88, DW_AT_name("Aptr")
    1933                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("Aptr")
    1934                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1936                            .dwattr $C$DW$88, DW_AT_decl_file("..\adc/adc.h")
    1937                            .dwattr $C$DW$88, DW_AT_decl_line(0x1d)
    1938                            .dwattr $C$DW$88, DW_AT_decl_column(0x11)
    1939                    $C$DW$89        .dwtag  DW_TAG_member
    1940                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$31)
    1941                            .dwattr $C$DW$89, DW_AT_name("distPTR")
    1942                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("distPTR")
    1943                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1944                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1945                            .dwattr $C$DW$89, DW_AT_decl_file("..\adc/adc.h")
    1946                            .dwattr $C$DW$89, DW_AT_decl_line(0x1e)
    1947                            .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1948                    $C$DW$90        .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$16)
    1950                            .dwattr $C$DW$90, DW_AT_name("vel")
    1951                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("vel")
    1952                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1953                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$90, DW_AT_decl_file("..\adc/adc.h")
    1955                            .dwattr $C$DW$90, DW_AT_decl_line(0x1f)
    1956                            .dwattr $C$DW$90, DW_AT_decl_column(0x0a)
    1957                    $C$DW$91        .dwtag  DW_TAG_member
    1958                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$32)
    1959                            .dwattr $C$DW$91, DW_AT_name("spazio")
    1960                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("spazio")
    1961                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1962                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1963                            .dwattr $C$DW$91, DW_AT_decl_file("..\adc/adc.h")
    1964                            .dwattr $C$DW$91, DW_AT_decl_line(0x20)
    1965                            .dwattr $C$DW$91, DW_AT_decl_column(0x0a)
    1966                            .dwendtag $C$DW$T$33
    1967                    
    1968                            .dwattr $C$DW$T$33, DW_AT_decl_file("..\adc/adc.h")
    1969                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1c)
    1970                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    1971                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("cinematica")
    1972                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$33)
    1973                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1974                            .dwattr $C$DW$T$41, DW_AT_decl_file("..\adc/adc.h")
    1975                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x21)
    1976                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x03)
    1977                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1978                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1979                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1980                    
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   37

    1981                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1982                            .dwattr $C$DW$T$34, DW_AT_name("_colore")
    1983                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    1984                    $C$DW$92        .dwtag  DW_TAG_member
    1985                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$10)
    1986                            .dwattr $C$DW$92, DW_AT_name("rosso")
    1987                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("rosso")
    1988                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1990                            .dwattr $C$DW$92, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1991                            .dwattr $C$DW$92, DW_AT_decl_line(0x21)
    1992                            .dwattr $C$DW$92, DW_AT_decl_column(0x06)
    1993                    $C$DW$93        .dwtag  DW_TAG_member
    1994                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$10)
    1995                            .dwattr $C$DW$93, DW_AT_name("verde")
    1996                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("verde")
    1997                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1998                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1999                            .dwattr $C$DW$93, DW_AT_decl_file("..\sens_col_ir/sens.h")
    2000                            .dwattr $C$DW$93, DW_AT_decl_line(0x22)
    2001                            .dwattr $C$DW$93, DW_AT_decl_column(0x06)
    2002                    $C$DW$94        .dwtag  DW_TAG_member
    2003                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$10)
    2004                            .dwattr $C$DW$94, DW_AT_name("blu")
    2005                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("blu")
    2006                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2007                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2008                            .dwattr $C$DW$94, DW_AT_decl_file("..\sens_col_ir/sens.h")
    2009                            .dwattr $C$DW$94, DW_AT_decl_line(0x23)
    2010                            .dwattr $C$DW$94, DW_AT_decl_column(0x06)
    2011                    $C$DW$95        .dwtag  DW_TAG_member
    2012                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$10)
    2013                            .dwattr $C$DW$95, DW_AT_name("luminanza")
    2014                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("luminanza")
    2015                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2016                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2017                            .dwattr $C$DW$95, DW_AT_decl_file("..\sens_col_ir/sens.h")
    2018                            .dwattr $C$DW$95, DW_AT_decl_line(0x24)
    2019                            .dwattr $C$DW$95, DW_AT_decl_column(0x06)
    2020                    $C$DW$96        .dwtag  DW_TAG_member
    2021                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$10)
    2022                            .dwattr $C$DW$96, DW_AT_name("bianco")
    2023                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("bianco")
    2024                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2025                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2026                            .dwattr $C$DW$96, DW_AT_decl_file("..\sens_col_ir/sens.h")
    2027                            .dwattr $C$DW$96, DW_AT_decl_line(0x25)
    2028                            .dwattr $C$DW$96, DW_AT_decl_column(0x06)
    2029                            .dwendtag $C$DW$T$34
    2030                    
    2031                            .dwattr $C$DW$T$34, DW_AT_decl_file("..\sens_col_ir/sens.h")
    2032                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x20)
    2033                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
    2034                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("colore")
    2035                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$34)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   38

    2036                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2037                            .dwattr $C$DW$T$39, DW_AT_decl_file("..\sens_col_ir/sens.h")
    2038                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x26)
    2039                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    2040                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2041                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2042                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    2043                    
    2044                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2045                            .dwattr $C$DW$T$47, DW_AT_name("_dati")
    2046                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x1c)
    2047                    $C$DW$97        .dwtag  DW_TAG_member
    2048                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$36)
    2049                            .dwattr $C$DW$97, DW_AT_name("gPtr")
    2050                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("gPtr")
    2051                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2053                            .dwattr $C$DW$97, DW_AT_decl_file("..\init.h")
    2054                            .dwattr $C$DW$97, DW_AT_decl_line(0x42)
    2055                            .dwattr $C$DW$97, DW_AT_decl_column(0x0a)
    2056                    $C$DW$98        .dwtag  DW_TAG_member
    2057                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$38)
    2058                            .dwattr $C$DW$98, DW_AT_name("tempPtr")
    2059                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("tempPtr")
    2060                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2061                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2062                            .dwattr $C$DW$98, DW_AT_decl_file("..\init.h")
    2063                            .dwattr $C$DW$98, DW_AT_decl_line(0x43)
    2064                            .dwattr $C$DW$98, DW_AT_decl_column(0x0f)
    2065                    $C$DW$99        .dwtag  DW_TAG_member
    2066                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$40)
    2067                            .dwattr $C$DW$99, DW_AT_name("colPtr")
    2068                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("colPtr")
    2069                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2070                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$99, DW_AT_decl_file("..\init.h")
    2072                            .dwattr $C$DW$99, DW_AT_decl_line(0x44)
    2073                            .dwattr $C$DW$99, DW_AT_decl_column(0x0c)
    2074                    $C$DW$100       .dwtag  DW_TAG_member
    2075                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$31)
    2076                            .dwattr $C$DW$100, DW_AT_name("distPtr")
    2077                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("distPtr")
    2078                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2079                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2080                            .dwattr $C$DW$100, DW_AT_decl_file("..\init.h")
    2081                            .dwattr $C$DW$100, DW_AT_decl_line(0x45)
    2082                            .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    2083                    $C$DW$101       .dwtag  DW_TAG_member
    2084                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$42)
    2085                            .dwattr $C$DW$101, DW_AT_name("cinPtr")
    2086                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("cinPtr")
    2087                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2088                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2089                            .dwattr $C$DW$101, DW_AT_decl_file("..\init.h")
    2090                            .dwattr $C$DW$101, DW_AT_decl_line(0x46)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   39

    2091                            .dwattr $C$DW$101, DW_AT_decl_column(0x0f)
    2092                    $C$DW$102       .dwtag  DW_TAG_member
    2093                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$44)
    2094                            .dwattr $C$DW$102, DW_AT_name("qeiPtr")
    2095                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("qeiPtr")
    2096                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2097                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2098                            .dwattr $C$DW$102, DW_AT_decl_file("..\init.h")
    2099                            .dwattr $C$DW$102, DW_AT_decl_line(0x47)
    2100                            .dwattr $C$DW$102, DW_AT_decl_column(0x09)
    2101                    $C$DW$103       .dwtag  DW_TAG_member
    2102                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$46)
    2103                            .dwattr $C$DW$103, DW_AT_name("surPtr")
    2104                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("surPtr")
    2105                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2106                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2107                            .dwattr $C$DW$103, DW_AT_decl_file("..\init.h")
    2108                            .dwattr $C$DW$103, DW_AT_decl_line(0x48)
    2109                            .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    2110                            .dwendtag $C$DW$T$47
    2111                    
    2112                            .dwattr $C$DW$T$47, DW_AT_decl_file("..\init.h")
    2113                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x41)
    2114                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2115                    $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("dati")
    2116                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$47)
    2117                            .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    2118                            .dwattr $C$DW$T$138, DW_AT_decl_file("..\init.h")
    2119                            .dwattr $C$DW$T$138, DW_AT_decl_line(0x49)
    2120                            .dwattr $C$DW$T$138, DW_AT_decl_column(0x03)
    2121                    
    2122                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2123                            .dwattr $C$DW$T$52, DW_AT_name("_dist")
    2124                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x50)
    2125                    $C$DW$104       .dwtag  DW_TAG_member
    2126                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$48)
    2127                            .dwattr $C$DW$104, DW_AT_name("misSens")
    2128                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("misSens")
    2129                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2131                            .dwattr $C$DW$104, DW_AT_decl_file("..\adc/adc.h")
    2132                            .dwattr $C$DW$104, DW_AT_decl_line(0x12)
    2133                            .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    2134                    $C$DW$105       .dwtag  DW_TAG_member
    2135                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$16)
    2136                            .dwattr $C$DW$105, DW_AT_name("kf")
    2137                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("kf")
    2138                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2139                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2140                            .dwattr $C$DW$105, DW_AT_decl_file("..\adc/adc.h")
    2141                            .dwattr $C$DW$105, DW_AT_decl_line(0x13)
    2142                            .dwattr $C$DW$105, DW_AT_decl_column(0x0a)
    2143                    $C$DW$106       .dwtag  DW_TAG_member
    2144                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$49)
    2145                            .dwattr $C$DW$106, DW_AT_name("d_mm")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   40

    2146                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("d_mm")
    2147                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2148                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2149                            .dwattr $C$DW$106, DW_AT_decl_file("..\adc/adc.h")
    2150                            .dwattr $C$DW$106, DW_AT_decl_line(0x14)
    2151                            .dwattr $C$DW$106, DW_AT_decl_column(0x08)
    2152                    $C$DW$107       .dwtag  DW_TAG_member
    2153                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$51)
    2154                            .dwattr $C$DW$107, DW_AT_name("dI")
    2155                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("dI")
    2156                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2157                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2158                            .dwattr $C$DW$107, DW_AT_decl_file("..\adc/adc.h")
    2159                            .dwattr $C$DW$107, DW_AT_decl_line(0x15)
    2160                            .dwattr $C$DW$107, DW_AT_decl_column(0x0b)
    2161                    $C$DW$108       .dwtag  DW_TAG_member
    2162                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$26)
    2163                            .dwattr $C$DW$108, DW_AT_name("run")
    2164                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("run")
    2165                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2166                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2167                            .dwattr $C$DW$108, DW_AT_decl_file("..\adc/adc.h")
    2168                            .dwattr $C$DW$108, DW_AT_decl_line(0x16)
    2169                            .dwattr $C$DW$108, DW_AT_decl_column(0x08)
    2170                            .dwendtag $C$DW$T$52
    2171                    
    2172                            .dwattr $C$DW$T$52, DW_AT_decl_file("..\adc/adc.h")
    2173                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x10)
    2174                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    2175                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("distanza")
    2176                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$52)
    2177                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2178                            .dwattr $C$DW$T$30, DW_AT_decl_file("..\adc/adc.h")
    2179                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x18)
    2180                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
    2181                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2182                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2183                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    2184                    
    2185                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2186                            .dwattr $C$DW$T$55, DW_AT_name("_gyro")
    2187                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x40)
    2188                    $C$DW$109       .dwtag  DW_TAG_member
    2189                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$6)
    2190                            .dwattr $C$DW$109, DW_AT_name("IsPresent")
    2191                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("IsPresent")
    2192                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2194                            .dwattr $C$DW$109, DW_AT_decl_file("..\gyro_f.h")
    2195                            .dwattr $C$DW$109, DW_AT_decl_line(0x11)
    2196                            .dwattr $C$DW$109, DW_AT_decl_column(0x07)
    2197                    $C$DW$110       .dwtag  DW_TAG_member
    2198                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$6)
    2199                            .dwattr $C$DW$110, DW_AT_name("IsOn")
    2200                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("IsOn")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   41

    2201                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2202                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2203                            .dwattr $C$DW$110, DW_AT_decl_file("..\gyro_f.h")
    2204                            .dwattr $C$DW$110, DW_AT_decl_line(0x12)
    2205                            .dwattr $C$DW$110, DW_AT_decl_column(0x07)
    2206                    $C$DW$111       .dwtag  DW_TAG_member
    2207                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$54)
    2208                            .dwattr $C$DW$111, DW_AT_name("x0")
    2209                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("x0")
    2210                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2211                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2212                            .dwattr $C$DW$111, DW_AT_decl_file("..\gyro_f.h")
    2213                            .dwattr $C$DW$111, DW_AT_decl_line(0x14)
    2214                            .dwattr $C$DW$111, DW_AT_decl_column(0x0a)
    2215                    $C$DW$112       .dwtag  DW_TAG_member
    2216                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$54)
    2217                            .dwattr $C$DW$112, DW_AT_name("y0")
    2218                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("y0")
    2219                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2220                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2221                            .dwattr $C$DW$112, DW_AT_decl_file("..\gyro_f.h")
    2222                            .dwattr $C$DW$112, DW_AT_decl_line(0x14)
    2223                            .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    2224                    $C$DW$113       .dwtag  DW_TAG_member
    2225                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$54)
    2226                            .dwattr $C$DW$113, DW_AT_name("z0")
    2227                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("z0")
    2228                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2229                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2230                            .dwattr $C$DW$113, DW_AT_decl_file("..\gyro_f.h")
    2231                            .dwattr $C$DW$113, DW_AT_decl_line(0x14)
    2232                            .dwattr $C$DW$113, DW_AT_decl_column(0x12)
    2233                    $C$DW$114       .dwtag  DW_TAG_member
    2234                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$6)
    2235                            .dwattr $C$DW$114, DW_AT_name("asseOn")
    2236                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("asseOn")
    2237                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2238                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$114, DW_AT_decl_file("..\gyro_f.h")
    2240                            .dwattr $C$DW$114, DW_AT_decl_line(0x16)
    2241                            .dwattr $C$DW$114, DW_AT_decl_column(0x07)
    2242                    $C$DW$115       .dwtag  DW_TAG_member
    2243                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$54)
    2244                            .dwattr $C$DW$115, DW_AT_name("yaw")
    2245                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("yaw")
    2246                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2247                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2248                            .dwattr $C$DW$115, DW_AT_decl_file("..\gyro_f.h")
    2249                            .dwattr $C$DW$115, DW_AT_decl_line(0x19)
    2250                            .dwattr $C$DW$115, DW_AT_decl_column(0x0a)
    2251                    $C$DW$116       .dwtag  DW_TAG_member
    2252                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$54)
    2253                            .dwattr $C$DW$116, DW_AT_name("roll")
    2254                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("roll")
    2255                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   42

    2256                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2257                            .dwattr $C$DW$116, DW_AT_decl_file("..\gyro_f.h")
    2258                            .dwattr $C$DW$116, DW_AT_decl_line(0x1a)
    2259                            .dwattr $C$DW$116, DW_AT_decl_column(0x0a)
    2260                    $C$DW$117       .dwtag  DW_TAG_member
    2261                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$54)
    2262                            .dwattr $C$DW$117, DW_AT_name("pitch")
    2263                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("pitch")
    2264                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2265                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2266                            .dwattr $C$DW$117, DW_AT_decl_file("..\gyro_f.h")
    2267                            .dwattr $C$DW$117, DW_AT_decl_line(0x1b)
    2268                            .dwattr $C$DW$117, DW_AT_decl_column(0x0a)
    2269                    $C$DW$118       .dwtag  DW_TAG_member
    2270                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$16)
    2271                            .dwattr $C$DW$118, DW_AT_name("yawF")
    2272                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("yawF")
    2273                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2274                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2275                            .dwattr $C$DW$118, DW_AT_decl_file("..\gyro_f.h")
    2276                            .dwattr $C$DW$118, DW_AT_decl_line(0x1e)
    2277                            .dwattr $C$DW$118, DW_AT_decl_column(0x08)
    2278                    $C$DW$119       .dwtag  DW_TAG_member
    2279                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$16)
    2280                            .dwattr $C$DW$119, DW_AT_name("rollF")
    2281                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("rollF")
    2282                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2283                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2284                            .dwattr $C$DW$119, DW_AT_decl_file("..\gyro_f.h")
    2285                            .dwattr $C$DW$119, DW_AT_decl_line(0x1f)
    2286                            .dwattr $C$DW$119, DW_AT_decl_column(0x08)
    2287                    $C$DW$120       .dwtag  DW_TAG_member
    2288                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$16)
    2289                            .dwattr $C$DW$120, DW_AT_name("pitchF")
    2290                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("pitchF")
    2291                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2292                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2293                            .dwattr $C$DW$120, DW_AT_decl_file("..\gyro_f.h")
    2294                            .dwattr $C$DW$120, DW_AT_decl_line(0x20)
    2295                            .dwattr $C$DW$120, DW_AT_decl_column(0x08)
    2296                    $C$DW$121       .dwtag  DW_TAG_member
    2297                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$16)
    2298                            .dwattr $C$DW$121, DW_AT_name("yawP")
    2299                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("yawP")
    2300                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2301                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2302                            .dwattr $C$DW$121, DW_AT_decl_file("..\gyro_f.h")
    2303                            .dwattr $C$DW$121, DW_AT_decl_line(0x22)
    2304                            .dwattr $C$DW$121, DW_AT_decl_column(0x08)
    2305                    $C$DW$122       .dwtag  DW_TAG_member
    2306                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$16)
    2307                            .dwattr $C$DW$122, DW_AT_name("rollP")
    2308                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rollP")
    2309                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2310                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
pid.asm                                                              PAGE   43

    2311                            .dwattr $C$DW$122, DW_AT_decl_file("..\gyro_f.h")
    2312                            .dwattr $C$DW$122, DW_AT_decl_line(0x22)
    2313                            .dwattr $C$DW$122, DW_AT_decl_column(0x0e)
    2314                    $C$DW$123       .dwtag  DW_TAG_member
    2315                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$16)
    2316                            .dwattr $C$DW$123, DW_AT_name("pitchP")
    2317                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("pitchP")
    2318                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2319                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2320                            .dwattr $C$DW$123, DW_AT_decl_file("..\gyro_f.h")
    2321                            .dwattr $C$DW$123, DW_AT_decl_line(0x22)
    2322                            .dwattr $C$DW$123, DW_AT_decl_column(0x15)
    2323                    $C$DW$124       .dwtag  DW_TAG_member
    2324                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$54)
    2325                            .dwattr $C$DW$124, DW_AT_name("gradiSec")
    2326                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("gradiSec")
    2327                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2328                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2329                            .dwattr $C$DW$124, DW_AT_decl_file("..\gyro_f.h")
    2330                            .dwattr $C$DW$124, DW_AT_decl_line(0x24)
    2331                            .dwattr $C$DW$124, DW_AT_decl_column(0x0a)
    2332                    $C$DW$125       .dwtag  DW_TAG_member
    2333                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$16)
    2334                            .dwattr $C$DW$125, DW_AT_name("FS")
    2335                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("FS")
    2336                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2337                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2338                            .dwattr $C$DW$125, DW_AT_decl_file("..\gyro_f.h")
    2339                            .dwattr $C$DW$125, DW_AT_decl_line(0x25)
    2340                            .dwattr $C$DW$125, DW_AT_decl_column(0x08)
    2341                    $C$DW$126       .dwtag  DW_TAG_member
    2342                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$16)
    2343                            .dwattr $C$DW$126, DW_AT_name("tick")
    2344                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("tick")
    2345                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2346                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2347                            .dwattr $C$DW$126, DW_AT_decl_file("..\gyro_f.h")
    2348                            .dwattr $C$DW$126, DW_AT_decl_line(0x27)
    2349                            .dwattr $C$DW$126, DW_AT_decl_column(0x08)
    2350                    $C$DW$127       .dwtag  DW_TAG_member
    2351                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$16)
    2352                            .dwattr $C$DW$127, DW_AT_name("kz")
    2353                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("kz")
    2354                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2355                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2356                            .dwattr $C$DW$127, DW_AT_decl_file("..\gyro_f.h")
    2357                            .dwattr $C$DW$127, DW_AT_decl_line(0x29)
    2358                            .dwattr $C$DW$127, DW_AT_decl_column(0x08)
    2359                    $C$DW$128       .dwtag  DW_TAG_member
    2360                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$16)
    2361                            .dwattr $C$DW$128, DW_AT_name("ky")
    2362                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("ky")
    2363                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2364                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2365                            .dwattr $C$DW$128, DW_AT_decl_file("..\gyro_f.h")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:33 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
