TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.6 *
       3                    ;* Date/Time created: Wed Feb 10 23:08:37 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --diag_wrap=off --disabl
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../tiva_timer.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.6 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti6\workspace\tiva-pid\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("TimerConfigure")

     868                            .dwendtag $C$DW$47
     869                    
     870                    ;******************************************************************************
     871                    ;* FLOATING-POINT CONSTANTS                                                   *
     872                    ;******************************************************************************
     873 00000180                   .sect   ".text"
     874                            .align  4
     875 00000180 447A0000  ||$C$FL1||:     .word   0447a0000h      ; 1000
     876                    ;******************************************************************************
     877                    ;* CONSTANT TABLE                                                             *
     878                    ;******************************************************************************
     879 00000184                   .sect   ".text"
     880                            .align  4
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   17

     881 00000184 0100003C  ||$C$CON1||:    .bits   16777276,32
     882                            .align  4
     883 00000188 40030000  ||$C$CON2||:    .bits   1073938432,32
     884                            .align  4
     885 0000018c 00000000! ||$C$CON3||:    .bits   procCom,32
     886                            .align  4
     887 00000190 00000000! ||$C$CON4||:    .bits   cont_sens_ir$1,32
     888                            .align  4
     889 00000194 00000000! ||$C$CON5||:    .bits   servo,32
     890                            .align  4
     891 00000198 00000000! ||$C$CON6||:    .bits   TEMPptr,32
     892                            .align  4
     893 0000019c 01000078  ||$C$CON7||:    .bits   16777336,32
     894                            .align  4
     895 000001a0 01000044  ||$C$CON8||:    .bits   16777284,32
     896                            .align  4
     897 000001a4 F0000805  ||$C$CON9||:    .bits   -268433403,32
     898                            .align  4
     899 000001a8 01000020  ||$C$CON10||:   .bits   16777248,32
     900                            .align  4
     901 000001ac 40025000  ||$C$CON11||:   .bits   1073893376,32
     902                            .align  4
     903 000001b0 F0000400  ||$C$CON12||:   .bits   -268434432,32
     904                            .align  4
     905 000001b4 01000048  ||$C$CON13||:   .bits   16777288,32
     906                            .align  4
     907 000001b8 F0000401  ||$C$CON14||:   .bits   -268434431,32
     908                            .align  4
     909 000001bc 40031000  ||$C$CON15||:   .bits   1073942528,32
     910                    ;*****************************************************************************
     911                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     912                    ;*****************************************************************************
     913                            .global TimerConfigure
     914                            .global TimerLoadSet
     915                            .global TimerIntEnable
     916                            .global SysCtlClockGet
     917                            .global pwmPowerA7
     918                            .global IntEnable
     919                            .global readTemp
     920                            .global procCom
     921                            .global servo
     922                            .global TEMPptr
     923                    
     924                    ;******************************************************************************
     925                    ;* BUILD ATTRIBUTES                                                           *
     926                    ;******************************************************************************
     927                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     928                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     929                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     930                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     931                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     932                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     933                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
     934                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     935                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   18

     936                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     937                    
     938                    ;******************************************************************************
     939                    ;* TYPE INFORMATION                                                           *
     940                    ;******************************************************************************
     941                    
     942                    $C$DW$T$20      .dwtag  DW_TAG_union_type
     943                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x10)
     944                    $C$DW$58        .dwtag  DW_TAG_member
     945                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     946                            .dwattr $C$DW$58, DW_AT_name("_Word")
     947                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Word")
     948                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     950                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
     951                            .dwattr $C$DW$58, DW_AT_decl_line(0x81)
     952                            .dwattr $C$DW$58, DW_AT_decl_column(0x11)
     953                    $C$DW$59        .dwtag  DW_TAG_member
     954                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$16)
     955                            .dwattr $C$DW$59, DW_AT_name("_Float")
     956                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Float")
     957                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     958                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     959                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
     960                            .dwattr $C$DW$59, DW_AT_decl_line(0x82)
     961                            .dwattr $C$DW$59, DW_AT_decl_column(0x08)
     962                    $C$DW$60        .dwtag  DW_TAG_member
     963                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$17)
     964                            .dwattr $C$DW$60, DW_AT_name("_Double")
     965                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Double")
     966                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     968                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
     969                            .dwattr $C$DW$60, DW_AT_decl_line(0x83)
     970                            .dwattr $C$DW$60, DW_AT_decl_column(0x09)
     971                    $C$DW$61        .dwtag  DW_TAG_member
     972                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$18)
     973                            .dwattr $C$DW$61, DW_AT_name("_Long_double")
     974                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Long_double")
     975                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     977                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
     978                            .dwattr $C$DW$61, DW_AT_decl_line(0x84)
     979                            .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
     980                            .dwendtag $C$DW$T$20
     981                    
     982                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
     983                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x80)
     984                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x02)
     985                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("_Dconst")
     986                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$20)
     987                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
     988                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/ymath.h")
     989                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x85)
     990                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x04)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   19

     991                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     992                            .dwattr $C$DW$T$2, DW_AT_name("void")
     993                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     994                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     995                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     996                    $C$DW$T$4       .dwtag  DW_TAG_base_type
     997                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     998                            .dwattr $C$DW$T$4, DW_AT_name("bool")
     999                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1000                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1001                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1002                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1003                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1004                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    1005                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$5)
    1006                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1007                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1008                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2a)
    1009                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x1d)
    1010                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    1011                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1012                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1013                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1014                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x37)
    1015                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x17)
    1016                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1017                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1018                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1019                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1020                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    1021                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    1022                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1023                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1024                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2b)
    1025                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1c)
    1026                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    1027                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
    1028                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1029                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1030                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x38)
    1031                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x16)
    1032                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1033                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1034                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1035                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1036                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1037                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1038                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1039                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1040                    $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    1041                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$8)
    1042                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1043                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1044                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x2c)
    1045                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   20

    1046                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    1047                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$24)
    1048                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1049                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1050                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x3a)
    1051                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x17)
    1052                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1053                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1054                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1055                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1056                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("_Wchart")
    1057                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$9)
    1058                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1059                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1060                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x1fe)
    1061                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x21)
    1062                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("_Wintt")
    1063                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$9)
    1064                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1065                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1066                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x1ff)
    1067                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x21)
    1068                    
    1069                    $C$DW$T$19      .dwtag  DW_TAG_array_type
    1070                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1071                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1072                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x10)
    1073                    $C$DW$62        .dwtag  DW_TAG_subrange_type
    1074                            .dwattr $C$DW$62, DW_AT_upper_bound(0x07)
    1075                            .dwendtag $C$DW$T$19
    1076                    
    1077                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1078                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$9)
    1079                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1080                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1081                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2d)
    1082                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x1c)
    1083                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    1084                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1085                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1086                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1087                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3b)
    1088                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x16)
    1089                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1090                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1091                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1092                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1093                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("_Ptrdifft")
    1094                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$10)
    1095                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1096                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1097                            .dwattr $C$DW$T$59, DW_AT_decl_line(0xa6)
    1098                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x1e)
    1099                    $C$DW$T$62      .dwtag  DW_TAG_volatile_type
    1100                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   21

    1101                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    1102                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$10)
    1103                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1104                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1105                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x2e)
    1106                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x1d)
    1107                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    1108                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
    1109                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1110                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1111                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x47)
    1112                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x17)
    1113                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    1114                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    1115                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1116                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1117                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x4a)
    1118                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x17)
    1119                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    1120                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$63)
    1121                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1122                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1123                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x45)
    1124                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x17)
    1125                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    1126                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$63)
    1127                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1128                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1129                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x3c)
    1130                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x17)
    1131                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    1132                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$10)
    1133                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1134                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1135                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x52)
    1136                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x1a)
    1137                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1138                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1139                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1140                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1141                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("_Sizet")
    1142                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$11)
    1143                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1144                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1145                            .dwattr $C$DW$T$69, DW_AT_decl_line(0xac)
    1146                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x1a)
    1147                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    1148                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
    1149                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1150                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1151                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2f)
    1152                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
    1153                    $C$DW$T$73      .dwtag  DW_TAG_volatile_type
    1154                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$26)
    1155                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   22

    1156                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$26)
    1157                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1158                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1159                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x48)
    1160                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x16)
    1161                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    1162                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$26)
    1163                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1164                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1165                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4b)
    1166                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x16)
    1167                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    1168                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$26)
    1169                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1170                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1171                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x46)
    1172                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x16)
    1173                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    1174                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$26)
    1175                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1176                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1177                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x3d)
    1178                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x16)
    1179                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    1180                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$11)
    1181                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1182                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1183                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x53)
    1184                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x1a)
    1185                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1186                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1187                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1188                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1189                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("_Int32t")
    1190                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$12)
    1191                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1192                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1193                            .dwattr $C$DW$T$79, DW_AT_decl_line(0xa2)
    1194                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x0e)
    1195                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1196                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1197                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1198                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1199                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("_Uint32t")
    1200                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$13)
    1201                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1202                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1203                            .dwattr $C$DW$T$80, DW_AT_decl_line(0xa3)
    1204                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x17)
    1205                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1206                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1207                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1208                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1209                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("_Longlong")
    1210                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   23

    1211                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1212                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1213                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x1ce)
    1214                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x13)
    1215                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    1216                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$14)
    1217                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1218                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1219                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x32)
    1220                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x21)
    1221                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    1222                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    1223                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1224                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1225                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x4e)
    1226                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x17)
    1227                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    1228                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$82)
    1229                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1230                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1231                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x40)
    1232                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x17)
    1233                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    1234                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$14)
    1235                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1236                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1237                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x56)
    1238                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x20)
    1239                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1240                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1241                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1242                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1243                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("_ULonglong")
    1244                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$15)
    1245                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1246                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1247                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x1cf)
    1248                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x14)
    1249                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    1250                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$15)
    1251                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1252                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1253                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x33)
    1254                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x20)
    1255                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    1256                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1257                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1258                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1259                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x4f)
    1260                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x16)
    1261                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    1262                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$87)
    1263                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1264                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1265                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x41)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   24

    1266                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x16)
    1267                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    1268                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$15)
    1269                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1270                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdint.h")
    1271                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x57)
    1272                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x20)
    1273                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1274                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1275                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1276                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1277                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("float_t")
    1278                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$16)
    1279                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1280                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/math.h")
    1281                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x62)
    1282                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x0f)
    1283                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1284                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1285                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1286                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1287                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("double_t")
    1288                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$17)
    1289                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1290                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/math.h")
    1291                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x63)
    1292                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x10)
    1293                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1294                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1295                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1296                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1297                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("_Sysch_t")
    1298                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$6)
    1299                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1300                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1301                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x23a)
    1302                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x0e)
    1303                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    1304                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$6)
    1305                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    1306                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("__builtin_va_list")
    1307                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1308                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1309                            .dwattr $C$DW$T$95, DW_AT_decl_file("../tiva_timer.c")
    1310                            .dwattr $C$DW$T$95, DW_AT_decl_line(0xb5)
    1311                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x01)
    1312                    
    1313                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1314                            .dwattr $C$DW$T$21, DW_AT_name("__va_list")
    1315                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1316                    $C$DW$63        .dwtag  DW_TAG_member
    1317                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$3)
    1318                            .dwattr $C$DW$63, DW_AT_name("__ap")
    1319                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("__ap")
    1320                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   25

    1321                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1322                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    1323                            .dwattr $C$DW$63, DW_AT_decl_line(0x32)
    1324                            .dwattr $C$DW$63, DW_AT_decl_column(0x0c)
    1325                            .dwendtag $C$DW$T$21
    1326                    
    1327                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    1328                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x31)
    1329                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1330                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1331                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$21)
    1332                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    1333                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/stdarg.h")
    1334                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x33)
    1335                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    1336                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("_Va_list")
    1337                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    1338                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1339                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti6/ccsv6/tools/compiler/arm_5.1.6/include/yvals.h")
    1340                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x218)
    1341                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x17)
    1342                    
    1343                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1344                            .dwattr $C$DW$T$22, DW_AT_name("_colore")
    1345                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x14)
    1346                    $C$DW$64        .dwtag  DW_TAG_member
    1347                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$10)
    1348                            .dwattr $C$DW$64, DW_AT_name("rosso")
    1349                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("rosso")
    1350                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1352                            .dwattr $C$DW$64, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1353                            .dwattr $C$DW$64, DW_AT_decl_line(0x21)
    1354                            .dwattr $C$DW$64, DW_AT_decl_column(0x06)
    1355                    $C$DW$65        .dwtag  DW_TAG_member
    1356                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$10)
    1357                            .dwattr $C$DW$65, DW_AT_name("verde")
    1358                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("verde")
    1359                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1360                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1361                            .dwattr $C$DW$65, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1362                            .dwattr $C$DW$65, DW_AT_decl_line(0x22)
    1363                            .dwattr $C$DW$65, DW_AT_decl_column(0x06)
    1364                    $C$DW$66        .dwtag  DW_TAG_member
    1365                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$10)
    1366                            .dwattr $C$DW$66, DW_AT_name("blu")
    1367                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("blu")
    1368                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1369                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1370                            .dwattr $C$DW$66, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1371                            .dwattr $C$DW$66, DW_AT_decl_line(0x23)
    1372                            .dwattr $C$DW$66, DW_AT_decl_column(0x06)
    1373                    $C$DW$67        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
    1375                            .dwattr $C$DW$67, DW_AT_name("luminanza")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   26

    1376                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("luminanza")
    1377                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1378                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$67, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1380                            .dwattr $C$DW$67, DW_AT_decl_line(0x24)
    1381                            .dwattr $C$DW$67, DW_AT_decl_column(0x06)
    1382                    $C$DW$68        .dwtag  DW_TAG_member
    1383                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
    1384                            .dwattr $C$DW$68, DW_AT_name("bianco")
    1385                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("bianco")
    1386                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1387                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1388                            .dwattr $C$DW$68, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1389                            .dwattr $C$DW$68, DW_AT_decl_line(0x25)
    1390                            .dwattr $C$DW$68, DW_AT_decl_column(0x06)
    1391                            .dwendtag $C$DW$T$22
    1392                    
    1393                            .dwattr $C$DW$T$22, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1394                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x20)
    1395                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    1396                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("colore")
    1397                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$22)
    1398                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1399                            .dwattr $C$DW$T$98, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1400                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x26)
    1401                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    1402                    
    1403                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1404                            .dwattr $C$DW$T$25, DW_AT_name("_gyro")
    1405                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x40)
    1406                    $C$DW$69        .dwtag  DW_TAG_member
    1407                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$6)
    1408                            .dwattr $C$DW$69, DW_AT_name("IsPresent")
    1409                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("IsPresent")
    1410                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1412                            .dwattr $C$DW$69, DW_AT_decl_file("..\gyro_f.h")
    1413                            .dwattr $C$DW$69, DW_AT_decl_line(0x11)
    1414                            .dwattr $C$DW$69, DW_AT_decl_column(0x07)
    1415                    $C$DW$70        .dwtag  DW_TAG_member
    1416                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$6)
    1417                            .dwattr $C$DW$70, DW_AT_name("IsOn")
    1418                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("IsOn")
    1419                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1420                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1421                            .dwattr $C$DW$70, DW_AT_decl_file("..\gyro_f.h")
    1422                            .dwattr $C$DW$70, DW_AT_decl_line(0x12)
    1423                            .dwattr $C$DW$70, DW_AT_decl_column(0x07)
    1424                    $C$DW$71        .dwtag  DW_TAG_member
    1425                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$24)
    1426                            .dwattr $C$DW$71, DW_AT_name("x0")
    1427                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("x0")
    1428                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1429                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1430                            .dwattr $C$DW$71, DW_AT_decl_file("..\gyro_f.h")
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   27

    1431                            .dwattr $C$DW$71, DW_AT_decl_line(0x14)
    1432                            .dwattr $C$DW$71, DW_AT_decl_column(0x0a)
    1433                    $C$DW$72        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$24)
    1435                            .dwattr $C$DW$72, DW_AT_name("y0")
    1436                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("y0")
    1437                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1438                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$72, DW_AT_decl_file("..\gyro_f.h")
    1440                            .dwattr $C$DW$72, DW_AT_decl_line(0x14)
    1441                            .dwattr $C$DW$72, DW_AT_decl_column(0x0e)
    1442                    $C$DW$73        .dwtag  DW_TAG_member
    1443                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$24)
    1444                            .dwattr $C$DW$73, DW_AT_name("z0")
    1445                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("z0")
    1446                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1447                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1448                            .dwattr $C$DW$73, DW_AT_decl_file("..\gyro_f.h")
    1449                            .dwattr $C$DW$73, DW_AT_decl_line(0x14)
    1450                            .dwattr $C$DW$73, DW_AT_decl_column(0x12)
    1451                    $C$DW$74        .dwtag  DW_TAG_member
    1452                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$6)
    1453                            .dwattr $C$DW$74, DW_AT_name("asseOn")
    1454                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("asseOn")
    1455                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1456                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1457                            .dwattr $C$DW$74, DW_AT_decl_file("..\gyro_f.h")
    1458                            .dwattr $C$DW$74, DW_AT_decl_line(0x16)
    1459                            .dwattr $C$DW$74, DW_AT_decl_column(0x07)
    1460                    $C$DW$75        .dwtag  DW_TAG_member
    1461                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$24)
    1462                            .dwattr $C$DW$75, DW_AT_name("yaw")
    1463                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("yaw")
    1464                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1465                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1466                            .dwattr $C$DW$75, DW_AT_decl_file("..\gyro_f.h")
    1467                            .dwattr $C$DW$75, DW_AT_decl_line(0x19)
    1468                            .dwattr $C$DW$75, DW_AT_decl_column(0x0a)
    1469                    $C$DW$76        .dwtag  DW_TAG_member
    1470                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$24)
    1471                            .dwattr $C$DW$76, DW_AT_name("roll")
    1472                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("roll")
    1473                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1474                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1475                            .dwattr $C$DW$76, DW_AT_decl_file("..\gyro_f.h")
    1476                            .dwattr $C$DW$76, DW_AT_decl_line(0x1a)
    1477                            .dwattr $C$DW$76, DW_AT_decl_column(0x0a)
    1478                    $C$DW$77        .dwtag  DW_TAG_member
    1479                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$24)
    1480                            .dwattr $C$DW$77, DW_AT_name("pitch")
    1481                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("pitch")
    1482                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1483                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1484                            .dwattr $C$DW$77, DW_AT_decl_file("..\gyro_f.h")
    1485                            .dwattr $C$DW$77, DW_AT_decl_line(0x1b)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   28

    1486                            .dwattr $C$DW$77, DW_AT_decl_column(0x0a)
    1487                    $C$DW$78        .dwtag  DW_TAG_member
    1488                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$16)
    1489                            .dwattr $C$DW$78, DW_AT_name("yawF")
    1490                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("yawF")
    1491                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1492                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1493                            .dwattr $C$DW$78, DW_AT_decl_file("..\gyro_f.h")
    1494                            .dwattr $C$DW$78, DW_AT_decl_line(0x1e)
    1495                            .dwattr $C$DW$78, DW_AT_decl_column(0x08)
    1496                    $C$DW$79        .dwtag  DW_TAG_member
    1497                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$16)
    1498                            .dwattr $C$DW$79, DW_AT_name("rollF")
    1499                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("rollF")
    1500                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1501                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1502                            .dwattr $C$DW$79, DW_AT_decl_file("..\gyro_f.h")
    1503                            .dwattr $C$DW$79, DW_AT_decl_line(0x1f)
    1504                            .dwattr $C$DW$79, DW_AT_decl_column(0x08)
    1505                    $C$DW$80        .dwtag  DW_TAG_member
    1506                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$16)
    1507                            .dwattr $C$DW$80, DW_AT_name("pitchF")
    1508                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("pitchF")
    1509                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1510                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1511                            .dwattr $C$DW$80, DW_AT_decl_file("..\gyro_f.h")
    1512                            .dwattr $C$DW$80, DW_AT_decl_line(0x20)
    1513                            .dwattr $C$DW$80, DW_AT_decl_column(0x08)
    1514                    $C$DW$81        .dwtag  DW_TAG_member
    1515                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$16)
    1516                            .dwattr $C$DW$81, DW_AT_name("yawP")
    1517                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("yawP")
    1518                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1519                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1520                            .dwattr $C$DW$81, DW_AT_decl_file("..\gyro_f.h")
    1521                            .dwattr $C$DW$81, DW_AT_decl_line(0x22)
    1522                            .dwattr $C$DW$81, DW_AT_decl_column(0x08)
    1523                    $C$DW$82        .dwtag  DW_TAG_member
    1524                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$16)
    1525                            .dwattr $C$DW$82, DW_AT_name("rollP")
    1526                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("rollP")
    1527                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1528                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1529                            .dwattr $C$DW$82, DW_AT_decl_file("..\gyro_f.h")
    1530                            .dwattr $C$DW$82, DW_AT_decl_line(0x22)
    1531                            .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1532                    $C$DW$83        .dwtag  DW_TAG_member
    1533                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$16)
    1534                            .dwattr $C$DW$83, DW_AT_name("pitchP")
    1535                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("pitchP")
    1536                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1537                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1538                            .dwattr $C$DW$83, DW_AT_decl_file("..\gyro_f.h")
    1539                            .dwattr $C$DW$83, DW_AT_decl_line(0x22)
    1540                            .dwattr $C$DW$83, DW_AT_decl_column(0x15)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   29

    1541                    $C$DW$84        .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
    1543                            .dwattr $C$DW$84, DW_AT_name("gradiSec")
    1544                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("gradiSec")
    1545                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1546                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1547                            .dwattr $C$DW$84, DW_AT_decl_file("..\gyro_f.h")
    1548                            .dwattr $C$DW$84, DW_AT_decl_line(0x24)
    1549                            .dwattr $C$DW$84, DW_AT_decl_column(0x0a)
    1550                    $C$DW$85        .dwtag  DW_TAG_member
    1551                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$16)
    1552                            .dwattr $C$DW$85, DW_AT_name("FS")
    1553                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("FS")
    1554                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1555                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1556                            .dwattr $C$DW$85, DW_AT_decl_file("..\gyro_f.h")
    1557                            .dwattr $C$DW$85, DW_AT_decl_line(0x25)
    1558                            .dwattr $C$DW$85, DW_AT_decl_column(0x08)
    1559                    $C$DW$86        .dwtag  DW_TAG_member
    1560                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$16)
    1561                            .dwattr $C$DW$86, DW_AT_name("tick")
    1562                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("tick")
    1563                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1564                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1565                            .dwattr $C$DW$86, DW_AT_decl_file("..\gyro_f.h")
    1566                            .dwattr $C$DW$86, DW_AT_decl_line(0x27)
    1567                            .dwattr $C$DW$86, DW_AT_decl_column(0x08)
    1568                    $C$DW$87        .dwtag  DW_TAG_member
    1569                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$16)
    1570                            .dwattr $C$DW$87, DW_AT_name("kz")
    1571                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("kz")
    1572                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1573                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1574                            .dwattr $C$DW$87, DW_AT_decl_file("..\gyro_f.h")
    1575                            .dwattr $C$DW$87, DW_AT_decl_line(0x29)
    1576                            .dwattr $C$DW$87, DW_AT_decl_column(0x08)
    1577                    $C$DW$88        .dwtag  DW_TAG_member
    1578                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$16)
    1579                            .dwattr $C$DW$88, DW_AT_name("ky")
    1580                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("ky")
    1581                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1582                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1583                            .dwattr $C$DW$88, DW_AT_decl_file("..\gyro_f.h")
    1584                            .dwattr $C$DW$88, DW_AT_decl_line(0x29)
    1585                            .dwattr $C$DW$88, DW_AT_decl_column(0x0c)
    1586                    $C$DW$89        .dwtag  DW_TAG_member
    1587                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$16)
    1588                            .dwattr $C$DW$89, DW_AT_name("kx")
    1589                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("kx")
    1590                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1591                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1592                            .dwattr $C$DW$89, DW_AT_decl_file("..\gyro_f.h")
    1593                            .dwattr $C$DW$89, DW_AT_decl_line(0x29)
    1594                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1595                            .dwendtag $C$DW$T$25
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   30

    1596                    
    1597                            .dwattr $C$DW$T$25, DW_AT_decl_file("..\gyro_f.h")
    1598                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x10)
    1599                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    1600                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("gyro")
    1601                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$25)
    1602                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1603                            .dwattr $C$DW$T$45, DW_AT_decl_file("..\gyro_f.h")
    1604                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2a)
    1605                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    1606                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    1607                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1608                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    1609                    
    1610                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1611                            .dwattr $C$DW$T$28, DW_AT_name("_pwm")
    1612                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x10)
    1613                    $C$DW$90        .dwtag  DW_TAG_member
    1614                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$26)
    1615                            .dwattr $C$DW$90, DW_AT_name("NCont")
    1616                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("NCont")
    1617                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1619                            .dwattr $C$DW$90, DW_AT_decl_file("..\pwm/pwm.h")
    1620                            .dwattr $C$DW$90, DW_AT_decl_line(0x1c)
    1621                            .dwattr $C$DW$90, DW_AT_decl_column(0x0c)
    1622                    $C$DW$91        .dwtag  DW_TAG_member
    1623                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
    1624                            .dwattr $C$DW$91, DW_AT_name("delta_1")
    1625                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("delta_1")
    1626                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1627                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1628                            .dwattr $C$DW$91, DW_AT_decl_file("..\pwm/pwm.h")
    1629                            .dwattr $C$DW$91, DW_AT_decl_line(0x1d)
    1630                            .dwattr $C$DW$91, DW_AT_decl_column(0x0c)
    1631                    $C$DW$92        .dwtag  DW_TAG_member
    1632                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$26)
    1633                            .dwattr $C$DW$92, DW_AT_name("delta_2")
    1634                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("delta_2")
    1635                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1636                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$92, DW_AT_decl_file("..\pwm/pwm.h")
    1638                            .dwattr $C$DW$92, DW_AT_decl_line(0x1e)
    1639                            .dwattr $C$DW$92, DW_AT_decl_column(0x0c)
    1640                    $C$DW$93        .dwtag  DW_TAG_member
    1641                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$27)
    1642                            .dwattr $C$DW$93, DW_AT_name("dir_1")
    1643                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("dir_1")
    1644                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1645                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1646                            .dwattr $C$DW$93, DW_AT_decl_file("..\pwm/pwm.h")
    1647                            .dwattr $C$DW$93, DW_AT_decl_line(0x1f)
    1648                            .dwattr $C$DW$93, DW_AT_decl_column(0x0c)
    1649                    $C$DW$94        .dwtag  DW_TAG_member
    1650                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   31

    1651                            .dwattr $C$DW$94, DW_AT_name("dir_2")
    1652                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("dir_2")
    1653                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1654                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1655                            .dwattr $C$DW$94, DW_AT_decl_file("..\pwm/pwm.h")
    1656                            .dwattr $C$DW$94, DW_AT_decl_line(0x20)
    1657                            .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1658                            .dwendtag $C$DW$T$28
    1659                    
    1660                            .dwattr $C$DW$T$28, DW_AT_decl_file("..\pwm/pwm.h")
    1661                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x1a)
    1662                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    1663                    $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("pwm")
    1664                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$28)
    1665                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1666                            .dwattr $C$DW$T$37, DW_AT_decl_file("..\pwm/pwm.h")
    1667                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x22)
    1668                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1669                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    1670                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1671                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    1672                    
    1673                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1674                            .dwattr $C$DW$T$29, DW_AT_name("_survivor")
    1675                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1676                    $C$DW$95        .dwtag  DW_TAG_member
    1677                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$27)
    1678                            .dwattr $C$DW$95, DW_AT_name("isSurvivor")
    1679                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("isSurvivor")
    1680                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1682                            .dwattr $C$DW$95, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1683                            .dwattr $C$DW$95, DW_AT_decl_line(0x2d)
    1684                            .dwattr $C$DW$95, DW_AT_decl_column(0x0a)
    1685                            .dwendtag $C$DW$T$29
    1686                    
    1687                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1688                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2c)
    1689                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1690                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("survivor")
    1691                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$29)
    1692                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1693                            .dwattr $C$DW$T$99, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1694                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x2e)
    1695                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x03)
    1696                    
    1697                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1698                            .dwattr $C$DW$T$30, DW_AT_name("_temp")
    1699                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x14)
    1700                    $C$DW$96        .dwtag  DW_TAG_member
    1701                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$16)
    1702                            .dwattr $C$DW$96, DW_AT_name("Temp")
    1703                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("Temp")
    1704                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   32

    1706                            .dwattr $C$DW$96, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1707                            .dwattr $C$DW$96, DW_AT_decl_line(0x31)
    1708                            .dwattr $C$DW$96, DW_AT_decl_column(0x09)
    1709                    $C$DW$97        .dwtag  DW_TAG_member
    1710                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$10)
    1711                            .dwattr $C$DW$97, DW_AT_name("tempRaw")
    1712                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("tempRaw")
    1713                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1714                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1715                            .dwattr $C$DW$97, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1716                            .dwattr $C$DW$97, DW_AT_decl_line(0x32)
    1717                            .dwattr $C$DW$97, DW_AT_decl_column(0x07)
    1718                    $C$DW$98        .dwtag  DW_TAG_member
    1719                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$10)
    1720                            .dwattr $C$DW$98, DW_AT_name("T_tar")
    1721                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("T_tar")
    1722                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1723                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1724                            .dwattr $C$DW$98, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1725                            .dwattr $C$DW$98, DW_AT_decl_line(0x33)
    1726                            .dwattr $C$DW$98, DW_AT_decl_column(0x07)
    1727                    $C$DW$99        .dwtag  DW_TAG_member
    1728                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$10)
    1729                            .dwattr $C$DW$99, DW_AT_name("Tcase")
    1730                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("Tcase")
    1731                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1732                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$99, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1734                            .dwattr $C$DW$99, DW_AT_decl_line(0x34)
    1735                            .dwattr $C$DW$99, DW_AT_decl_column(0x07)
    1736                    $C$DW$100       .dwtag  DW_TAG_member
    1737                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$10)
    1738                            .dwattr $C$DW$100, DW_AT_name("ok")
    1739                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("ok")
    1740                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1741                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1742                            .dwattr $C$DW$100, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1743                            .dwattr $C$DW$100, DW_AT_decl_line(0x35)
    1744                            .dwattr $C$DW$100, DW_AT_decl_column(0x07)
    1745                            .dwendtag $C$DW$T$30
    1746                    
    1747                            .dwattr $C$DW$T$30, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1748                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x30)
    1749                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1750                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("temperatura")
    1751                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$30)
    1752                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1753                            .dwattr $C$DW$T$100, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1754                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x36)
    1755                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    1756                    $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    1757                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    1758                            .dwattr $C$DW$T$101, DW_AT_address_class(0x20)
    1759                    
    1760                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   33

    1761                            .dwattr $C$DW$T$31, DW_AT_name("_tile")
    1762                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1763                    $C$DW$101       .dwtag  DW_TAG_member
    1764                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$6)
    1765                            .dwattr $C$DW$101, DW_AT_name("isDark")
    1766                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("isDark")
    1767                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1769                            .dwattr $C$DW$101, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1770                            .dwattr $C$DW$101, DW_AT_decl_line(0x29)
    1771                            .dwattr $C$DW$101, DW_AT_decl_column(0x07)
    1772                            .dwendtag $C$DW$T$31
    1773                    
    1774                            .dwattr $C$DW$T$31, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1775                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x28)
    1776                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1777                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("tile")
    1778                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$31)
    1779                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    1780                            .dwattr $C$DW$T$102, DW_AT_decl_file("..\sens_col_ir/sens.h")
    1781                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x2a)
    1782                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    1783                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1784                    
    1785                    ;***************************************************************
    1786                    ;* DWARF CIE ENTRIES                                           *
    1787                    ;***************************************************************
    1788                    
    1789                    $C$DW$CIE       .dwcie 14
    1790                            .dwcfi  cfa_register, 13
    1791                            .dwcfi  cfa_offset, 0
    1792                            .dwcfi  undefined, 0
    1793                            .dwcfi  undefined, 1
    1794                            .dwcfi  undefined, 2
    1795                            .dwcfi  undefined, 3
    1796                            .dwcfi  same_value, 4
    1797                            .dwcfi  same_value, 5
    1798                            .dwcfi  same_value, 6
    1799                            .dwcfi  same_value, 7
    1800                            .dwcfi  same_value, 8
    1801                            .dwcfi  same_value, 9
    1802                            .dwcfi  same_value, 10
    1803                            .dwcfi  same_value, 11
    1804                            .dwcfi  undefined, 12
    1805                            .dwcfi  undefined, 13
    1806                            .dwcfi  undefined, 14
    1807                            .dwcfi  undefined, 14
    1808                            .dwcfi  undefined, 7
    1809                            .dwcfi  undefined, 64
    1810                            .dwcfi  undefined, 65
    1811                            .dwcfi  undefined, 66
    1812                            .dwcfi  undefined, 67
    1813                            .dwcfi  undefined, 68
    1814                            .dwcfi  undefined, 69
    1815                            .dwcfi  undefined, 70
TI ARM Assembler PC v5.1.6 Wed Feb 10 23:08:37 2016

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tiva_timer.asm                                                       PAGE   34

    1816                            .dwcfi  undefined, 71
    1817                            .dwcfi  undefined, 72
    1818                            .dwcfi  undefined, 73
    1819                            .dwcfi  undefined, 74
    1820                            .dwcfi  undefined, 75
    1821                            .dwcfi  undefined, 76
    1822                            .dwcfi  undefined, 77
    1823                            .dwcfi  undefined, 78
    1824                            .dwcfi  undefined, 79
    1825                            .dwcfi  same_value, 80
